{
    "175175": "TIL It took Christopher Nolan 10 years to write Inception",
    "214008": "TIL that Justin Bieber has never had a number-one single in the United States or Great Britain.",
    "216985": "TIL that Taylor Swift owns a Dassault Falcon 900 private jet that cost around $40M and an airport hangar at Nashville International Airport.",
    "1c2gy9": "TIL JK Rowling wrote an alternative ending to the Harry Potter series.",
    "vvsb5": "TIL the Beatles have the best selling album of the 2000's",
    "1jzg51": "TIL Stephen King received over 60 rejection notices before his first short story was published.",
    "9k5ehv": "TIL the Broadway musical \"Spider-Man:Turn Off The Dark\" is the most expensive production in Broadway history($75M). Music and lyrics written by U2's Bono. There were numerous delays and injuries and one reason for closure was no longer being able to get injury insurance for the production.",
    "wehen": "TIL Some firefighters are trained on how to treat aliens, in the event of a UFO crash or invasion.",
    "1an4e2": "TIL not just dolphins rescue sailors, but sharks too",
    "4na2kc": "TIL North Korea were recognized by Guinness World Records for having the largest mass gymnastics performance",
    "1alt52": "TIL that Bill Murray thinks Kung Fu Hustle is \"the supreme achievement of the modern age in terms of comedy\".",
    "2cfqqd": "TIL the Nintendo Entertainment System was finally discontinued in September of 2003 in Japan.",
    "dcwgs": "TIL Old Navy markets jeans with a 41\" waist as 36\".",
    "29kbbe": "TIL the sunset on Mars is blue.",
    "3bnc6c": "TIL Women weren't allowed to wear pants on the United States Senate floor until 1993.",
    "96il9j": "TIL that Dr. Seuss wrote the screenplay for a live action musical called The 5,000 Fingers of Dr. T. The audience starting walking out of the Hollywood premiere after just 15 minutes. Dr. Seuss himself called the movie a \"debaculous fiasco.\"",
    "twkkl": "TIL that Morgan Freeman financed a Mississippi town's prom in 2008 with the stipulation that it be integrated.",
    "ncexi": "TIL that 5000 year old shoes perform better than modern shoes.",
    "8ccpuc": "TIL Edna Mode, the superhero costume designer in The Incredibles, is voiced by Brad Bird, the film's director. Bird voiced Edna during storyboarding sessions, after which the production team couldn't find an actress who could do the voice better than him.",
    "1y6zpt": "TIL the only US President to have a PhD is Woodrow Wilson",
    "l43z4": "TIL that baseball managers wear uniforms because they are technically able to play for their teams if the need arises",
    "19d7ur": "TIL the high school football stadium in Allen, Texas seats 18,000 and cost $60 million to build",
    "139xzr": "TIL that Tim Duncan of the San Antonio Spurs sacrificed money and stayed in college for four years instead of going directly to the NBA because in her last days, his dying mother made him promise to graduate college with a degree.",
    "9enlep": "TIL that since their reintroduction in 1999 as an NFL franchise, the quarterback with the most wins in the Cleveland Browns home stadium is Pittsburgh Steelers quarterback Ben Roethlisberger.",
    "2m6135": "TIL Jennifer Lee, writer and co-director of Frozen, is the first female director of a Walt Disney Animation Studios feature film, and the first female director of a feature film that earned more than $1 billion in gross box office revenue.",
    "orjas": "TIL that a state senator has to work at Target to make enough money to live.",
    "22yz9k": "TIL that Yoda, from Star Wars, was modeled after the appearance of Albert Einstein.",
    "yrtgh": "TIL There's a wiki which ranks fictional characters according to their powers and abilities.",
    "85g4ln": "TIL That an average NFL game only has 11 minutes of live gameplay",
    "1utb0o": "TIL President Jimmy Carter turned all White House thermostats down to 65 degrees during the winter of 1977.",
    "16w2g6": "TIL NFL Wide receiver Steve Smith leaves his cleats on the field after every game to raise awareness to homeless people without shoes",
    "6un5yv": "TIL that the most commonly used sentence in the Harry Potter book series was: \"Nothing happened.\"; for The Hunger Games series it was: \"My name is Katniss Everdeen.\", and for the Twilight series it was: \"I sighed.\"",
    "iyvlh": "TIL that the severed horse head in the famous The Godfather scene is a real severed horse head and the accompanying scream is authentic.",
    "3abg66": "TIL Patrick Stewart auditioned for the role of Jean Luc Picard on Star Trek The Next Generation while wearing a toupee.",
    "77y1pw": "TIL the Golden State Warriors earned about $12 million by losing Game 4 of the NBA Finals last season",
    "g2dpb": "TIL: The cables carrying phone and internet data across oceans are only 2.7 inches in diameter and just lay on the ocean floor.",
    "2h1yvl": "TIL that the car brand Cadillac was named after French explorer Antoine de la Mothe Cadillac who founded Detroit.",
    "nx808": "TIL That in 2007 Tom Cruise decided to spend $10 million on an underground bunker to protect himself from aliens.",
    "9dazvo": "TIL Activision has a patent on a matchmaking system designed to drive microtransactions in multiplayer video games",
    "2qrnbs": "TIL that the Fender Stratocaster was intended for Country Music",
    "3qrpla": "TIL that there is a statistical machine learning algorithm to detect whether a sentence contained a \"That's what she said\" double entendre.",
    "jdk9t": "TIL Republicans are statistically more educated than Democrats.",
    "3l1r90": "TIL The 3 horizontal line menu on apps and websites is called a hamburger button.",
    "7uwk0a": "TIL The Apple iPhone 8 Plus has a bill of materials cost of $288.08",
    "czqmks": "TIL Tom hardy recorded a hip hop mixtape in 1999 and it wasn't released until 2018.",
    "56vdk0": "TIL the song \"Radioactive\" by Imagine Dragons currently holds the record for most weeks spent on the Billboard Hot 100 at 87 weeks and the record for slowest ascension to the top 5 in chart history.",
    "1hf42v": "TIL That the anime sequences in the opening scene of Malcolm in the middle come from an anime called \"Nazca\"",
    "16ym2g": "TIL that CAPTCHA is an acronym for \"Completely Automated Public Turing test to tell Computers and Humans Apart\"",
    "20k5wb": "TIL the length of horse hair is strongly related to the amount of sunlight it gets.",
    "24wnvw": "TIL the final design for Chewbacca was based on an illustration for a 1975 novelette by George R.R. Martin",
    "3c8vh3": "TIL Tom Cruise hung off the side of a airplane that was soaring 5,000 feet for the new Mission Impossible movie.",
    "5iq0an": "TIL that the waiting list for season tickets for the Green Bay Packers is over 100,000 names, and about 30 years. In Green Bay and other Wisconsin cities, it is a common practice to put a baby's name on on the waiting list as soon as they are born.",
    "1kqqw0": "TIL some birds fly from Alaska to Northern mexico without sleeping when migrating. And the military is studying them to make sleepless soldiers.",
    "3rbrli": "TIL that Disney's Frozen movie caused an increase of 153% for flight searches to Norway and a hotel booking increase of 37%.",
    "2uw9xi": "TIL that tuna farmers would jump into tuna pens and wrestle with sharks that would try to get in.",
    "3w8kz1": "TIL That the Sacramento Public Library started a \"Library of Things\" earlier this year, allowing patrons to check out, among other things, sewing machines and other items that patrons may find useful, but don't need to own long-term.",
    "218wxs": "TIL \"button down\" is where the collar tips fasten to the body of the shirt, whereas \"button up\" does not",
    "1zeb2x": "TIL Queen's guitarist, Brian May, has a PhD in Astrophysics.",
    "wqvpb": "TIL Fox News Corporation discussed the possibility of creating a cable channel that would only air the Simpsons.",
    "7n1i4z": "TIL before the filming of Harry Potter and the Prisoner of Azkaban, director Alfonso Cuarón had Daniel Radcliffe, Rupert Grint, and Emma Watson write essays about their characters. Watson turned in a 16 page essay, Radcliffe gave a single page, and Grint forgot to turn his in.",
    "2ymv9t": "TIL the French National Football team brought the same color jersey as their opponents to their opening match in the 1978 World Cup, and had to borrow green and white striped jerseys from a local team for the match.",
    "9xcwoz": "TIL Andrew Bonar Law is the only person from outside the United Kingdom to ever become the Prime Minister of the UK",
    "24e6qs": "TIL each pawn in chess used to have its own name, after one of several commoners' occupations.",
    "ri8ra": "TIL that humans are the only mammals that can't breathe and swallow at the same time",
    "991cox": "TIL that in the first innings of the first-ever official international cricket match in 1877, the opening batsman set a record that still hasn't been surpassed in the thousands of matches played since then (he scored 165 runs out of his team's total of 245, a percentage nobody has equalled)",
    "1yw07i": "TIL in 2011 Donald Jackson and a team of calligraphers completed what is believed to the first illuminated and handwritten bible since the invention of the printing press. It took 12 years to complete and cost $8 million.",
    "7qys5o": "TIL: the founder of GUCCI was named Guccio Gucci.",
    "8a95ks": "TIL Avengers: Infinity War is the first film ever to be shot entirely with digital IMAX cameras",
    "15lcbd": "TIL that the 2012 U.S.Election was the first U.S. Election since 1944 in which neither major party ticket had a veteran on it.",
    "106hp1": "TIL Tom cruise threatened Tom Kruse, the inventor of the Hoveround over the usage of his name.",
    "13xqvn": "TIL that the aliens from the movie franchise Alien were based off of deep sea creatures found in Earth's oceans.",
    "t3iu9": "TIL Humans get goose bumps because of an evolutionary trait that was used to make fur stand up to make the animal appear larger.",
    "d09bo8": "TIL Stephen curry, the star of the golden state warriors and 2015 season mvp only made the 4th highest salary on his team in 2015.",
    "1qzz0z": "TIL that Icelandic horses have a fifth speed, tolt, that is basically speedwalking for a horse",
    "nmjeg": "TIL that the SNES, along with Sega Genesis, had an online multiplayer service.",
    "3bogwu": "TIL Jay-Z's 99 Problems has been used by law school professors to teach Criminal Procedure.",
    "20t1ge": "TIL the record for the longest overdue library book is 221 years - held by George Washington.",
    "xmv4m": "TIL That the United States has almost as many gold medals in swimming as the rest of the world combined.",
    "8oly1l": "TIL Stan Lee had a contract awarding him 10% of the net profits of anything based on his characters. The first Spider-Man made more than $800 million in revenue, but the producers claimed it did not make any profit and Lee received nothing.",
    "xvm7e": "TIL the cat is the most popular pet in the world.",
    "2701df": "TIL that E.T was originally scripted to be a horror movie.",
    "81j3th": "TIL the New York Yankees uniform, does not feature a name on the back. Due to the club believing that putting the names on the back puts unneeded attention on the players, rather than the team as a whole.",
    "20xmb7": "TIL: Michael Jackson wanted to build a 50 foot robot of himself to roam the Nevada desert.",
    "1fu4zv": "TIL ants were the first non-human meat farmers. An African breed of ants raises other bugs for food.",
    "1b6fmo": "TIL a man wore 70 items of clothing in a Chinese airport to avoid the bagging charge",
    "4b8tzg": "TIL that Stephen Curry, the star of the Golden State Warriors and 2015 season MVP only makes the 5th highest salary on his team.",
    "1d51bz": "TIL Only one of Shakespeare's plays has not been adapted for film or television, The Two Noble Kinsmen.",
    "11asbe": "TIL the gaming website IGN is owned by News Corporation, who also owns Fox News.",
    "3glf3j": "TIL Artificial Intelligence has crushed all human records in the puzzle game \"2048,\" achieving a high score of 839,732 and beating the game in only 973 moves without using any undos",
    "2qgduf": "TIL that it took the Secret Service four days to realize that bullets had struck the White House on November 11, 2011",
    "1feiw6": "TIL the practice of presidents returning a salute from members of the military started in 1981 by Ronald Reagan.",
    "t8biw": "TIL the waitress Captain America saves in The Avengers voiced Gretchen in Recess",
    "2mbg3e": "TIL NWA's Straight Outta Compton was the first album to reach platinum status without the support of airplay or a major tour",
    "uvtkw": "TIL Marvel Comics creator Stan Lee wrote 15 DC comics, re-imagining popular superheroes like Batman and Superman",
    "1xcx15": "TIL a critical step in creation of Wi-Fi was a byproduct of research into improving astronomy imaging",
    "2g2jz5": "TIL that U2 opened for themselves at a few shows in 1987. They were introduced as \"The Dalton Brothers from Galveston, Texas,\" and they played country music while disguised in wigs and costumes.",
    "4j6moe": "TIL Deadpool described himself as \"Ryan Reynolds crossed with a shar-pei\" in a 2004 comic book series, leading Reynolds to believe he was destined for the role.",
    "105li1": "TIL Jay-Z pulled his album \"American Gangster\" from iTunes, saying that \"as movies are not sold scene by scene, this collection will not be sold as individual singles.\"",
    "27mi43": "TIL Jennifer Love Hewitt doesn't have even a single film of hers rated fresh on rotten tomatoes.",
    "14nuia": "TIL that Ronald McDonald was one of the inspirations for designing Stephen King's \"It\"",
    "i31j8": "TIL that the longest game of monopoly lasted 70 days",
    "18aj2t": "TIL Walter White is also the name of a jazz musician who has a new album entitled \"Breaking Good\"",
    "187zy6": "TIL Meryl Streep, in addition to her acting accolades, landed a Top 10 hit on the Portuguese music charts in 2008.",
    "9t16ur": "TIL the US military is actually trying to achieve Spider-Man like abilities for their soldiers.",
    "j470j": "TIL that citizens of Austin TX voted to rename their garbage dump after Fred Durst",
    "3dpol3": "TIL the \"folds\" in a Chefs Hat are meant to represent the many different ways the chef can cook an egg",
    "rsapq": "TIL in 1957 President Harry Truman visited Disneyland and refused to be photographed on the Dumbo ride so he wouldn't be associated with Republicans",
    "im4rp": "TIL Dr. Martin Luther King Jr. was \"the biggest Trekkie on the planet.\"",
    "1sfw22": "TIL in the Harry Potter universe, Hogwarts is located in Scotland, not England.",
    "3fajux": "TIL When the Beatles broke up in 1970, none of them had yet turned 30 years old.",
    "1y2pjw": "TIL The Silence of the Lambs came out on Valentine's day in 1991 and had a box office of over $270 million.",
    "1u87rw": "TIL Bill Murray voiced the Human Torch in the 1970's Fantastic Four radio show",
    "2vnym3": "TIL The MIT Science Fiction Society has both a Lifetime Membership and a more expensive one that covers you in case you die and come back",
    "26w43b": "TIL ESPN won an emmy for the creation of the superimposed yellow line representing the first down line for American football games.",
    "2ln2p9": "TIL Led Zeppelin decided not to title their fourth album, to confuse the hated rock press",
    "2peqb1": "TIL Richard Nixon wrote a piano concerto, and performed it live on the Tonight Show",
    "170u2b": "TIL that everyone in Finland has the right to an internet connection",
    "9d2zin": "TIL Since the year 2000, Roger Federer (20), Rafael Nadal (17), and Novak Djokovic (13) have accounted for 56% of Men's Grand Slam Singles Titles.",
    "1bda1t": "TIL Termites eat through wood two times faster when listening to rock music",
    "25zfp2": "TIL Steph Curry from the golden state warriors basketball team plays part in a foundation that donates mosquito nets to protect families in Africa. For each 3 pointer he makes 3 nets get donated.",
    "4zdzxx": "TIL that in Michael Bay's 2007 film Transformers, there are 1.53 explosions per minute.",
    "d0cvic": "TIL The first person to carrier unlock the original iphone, george hotz, built a self driving car in his garage",
    "1l04et": "TIL Elvis Presley was naturally blonde. He dyed his hair black",
    "5iyaps": "TIL the 2010 Global Tiger Initiative summit in Russia pledged $330 million donor dollars for tiger conservation. Four years later, no financial help ever reached the Ussuriskii Nature Preserve, home to some of the last remaining Siberian tigers.",
    "xstdh": "TIL In 1975 the Soviet Union successfully sent a spacecraft to Venus, which captured the first images from the surface of another planet",
    "3zkcdk": "TIL that Colin McGregor, brother of Star Wars actor Ewan McGregor, is a British RAF pilot and goes by the call-sign \"Obi Two\"",
    "ouxh0": "TIL the sun is actually white, only perceived as yellow because of atmospheric scattering",
    "vwitz": "TIL Some Star Wars fans believe Chewbacca and R2-D2 Are Secret Rebel Agents",
    "cz9bct": "TIL Lady gaga's stage name came from queen's song \"radio ga ga\".",
    "3my2gz": "TIL that there is a surviving fantasy novel written in the 2nd century AD that features explorers flying to the moon, a first encounter with aliens, interplanetary war between imperialistic celestial kingdoms, and the discovery of a continent across the ocean",
    "qf7bz": "TIL Edgar Allan Poe only recieved $9 for the publication of his poem, \"The Raven.\"",
    "lp6w1": "TIL DC Comics paid $130 in 1938 for exclusive rights to Superman.",
    "5j8a9v": "TIL Teddy Roosevelt and John Quincy Adams are the only two US Presidents that did not use a Bible at their swearing-in ceremonies.",
    "2g54r2": "TIL Seinfeld has a net worth of roughly $820,000,000. More than Tom Hanks and Tom Cruise *combined*.",
    "17nck5": "TIL Levi made Bing Crosby a denim tuxedo after he was turned away from a hotel for wearing jeans",
    "5tfdql": "TIL of Dapper Dan, a Harlem man who was chief tailor to a number of New York rappers, athletes, and dealers in the 80s. His apparel was often covered in bootleg Gucci, Fendi, or Louis Vuitton logos. Mike Tyson, one of his customers, later had a fight which indirectly led to Dan's boutique closing.",
    "17ffej": "TIL over 86,000 people visit the ER each year from tripping or falling over their cat or dog.",
    "14yb3m": "TIL romantic kissing is a fairly recent development and is rarely mentioned even in ancient Greek literature.",
    "99lx0p": "TIL 20th Century Fox, convinced that Star Wars was going to flop, agreed to George Lucas’s proposition to forgo an additional $500K directing fee in return to keep licensing and merchandising rights for himself. This decision cost Fox billions and made George Lucas a Billionaire.",
    "1ffr46": "TIL until 1978 a tennis player was allowed to use absolutely any object as a racket.",
    "5z7x31": "TIL Celine Dion was fired from performing the theme to An American Tail: Fievel Goes West. Though initially reluctant from that experience, she eventually agreed to sing the theme to Beauty and the Beast, which launched her into international stardom.",
    "83cfjt": "TIL Pac-Man was originally going to be released in the US as Puckman but the name was changed out of fears the P would be vandalized into another letter.",
    "o3189": "TIL Facebook is primarily blue because Mark Zuckerburg suffers from red-green colorblindness",
    "5jiewh": "TIL the makers of the board game Monopoly will set up a hotline for a few days over the holiday period to help mediate any game-based arguments.",
    "8upwl2": "TIL that actress Helena Bonham Carter (Bellatrix in the Harry Potter films) is the great-granddaughter of Herbert Asquith, Prime Minister of the United Kingdom during World War I.",
    "cvece": "TIL Alfonso Cuarón's astounding movie, \"Children of Men\", lost over 6 million dollars at the box office.",
    "6p4ahx": "TIL the Fiddle and the Violin are the exact same instrument. The difference is the type of music you play with one or the other.",
    "29bcvw": "TIL George RR Martin despises fan fiction, saying that it is copyright infringement and a bad exercise for aspiring writers.",
    "8158dt": "TIL - China/Taiwan renamed Guardians of the Galaxy as: \"Interplanetary Unusual Attack Team\"",
    "tuz6d": "TIL that the tiny red bugs commonly found on concrete and bricks are called \"Clover Mites\"",
    "3k43o2": "TIL Graham Chapman of Monty Python was a Medical Doctor until he gave up his practice to concentrate on comedy.",
    "1nnhz8": "TIL Superman was originally created to be a villain based on the philosophy of Friedrich Nietzsche.",
    "233jhc": "TIL Dogs are not colour blind, but cannot see as many different colours as humans",
    "21qe39": "TIL experiments in Oculus Rift-like \"virtual reality\" headsets were being done as far back as 1968. Link goes to CG pioneer Ivan Sutherland demonstrating a stereoscopic head-mounted display that rendered computer-generated images depending upon the position of the viewer.",
    "37z5b7": "TIL that every individual shark has its own distinct character and personality- some sharks are shy, some are social",
    "d0cdh8": "TIL Ariana grande was caught licking the display donuts at a donut shop.",
    "9kicbe": "TIL Elton John answered an ad for a talent search. After failing the audition he told the person behind the desk that he can't write lyrics. He was handed an envelope with lyrics by another person who answered the ad and failed the audition Bernie Taupin, who then wrote the majority of Elton's songs",
    "1yrxv7": "TIL Hillary Clinton won the Grammy for Best Spoken Word Album for the audio recording of her book \"It Takes a Village\"",
    "pzb4r": "TIL there is a breed of jellyfish that is immortal",
    "2nfz30": "TIL Walt Disney to this day holds the record for most Oscars won by a man with 22 Oscars under his name.",
    "1192bo": "TIL that when you get a PhD in Finland, you are given a top hat and sword with your diploma.",
    "1rl90t": "TIL: Lebron James raised 6 million dollars for charity by televising \"The Decision\"",
    "6nhbm8": "TIL that after the Halo 2 multiplayer servers shut down in April 2010, players were able to play the game for three and a half weeks afterward by keeping their consoles on.",
    "151u5m": "TIL that Norman Rockwell painted the famous \"Rosie the Riveter\" larger than the model actually was. He apologized later by phone.",
    "360x2m": "TIL Steph Curry did not receive any college scholarship offers from a major conference school, and wanted to play at Virginia Tech.",
    "68m0sc": "TIL In Marvel's main universe Sir Isaac Newton was once Sorcerer Supreme, the same title later held by Doctor Strange.",
    "o7z0y": "TIL There is a webcam at Abbey Road and people periodically stop the traffic to recreate the Beatles image",
    "16khv8": "TIL the world record for speed reading is held by Anne Jones, with a reading speed of 4,700 words per minute",
    "1s9kh8": "TIL Albert Einstein wrote a quote in 1938 and placed it in a time capsule to be opened in 6939",
    "81jpp0": "TIL the rapper Drake visited Drake University in the middle of the night after students gave up trying to get him to visit during a tour stop",
    "2puuzy": "TIL J.R.R Tolkien wrote 13 pages of a sequel to Lord of the Rings called The New Shadow, but abandoned it.",
    "pzqdm": "TIL Johnny Depp directed the 1997 film 'The Brave'",
    "2ahm9x": "TIL: 95% of all modern Thoroughbred racehorses can trace their Y chromosome to one horse named Darley Arabian.",
    "aj4u7": "TIL Target has banned Salvation Army bell ringers from its premises.",
    "1d4byg": "TIL that the Moon is moving away from the Earth at about the rate that your fingernails grow",
    "26ylai": "TIL that Mario Kart Wii had a significant competitive scene outside of time trials including over 10 seasons of an international tournament called the \"World Clan League\" featuring hundreds of different teams.",
    "1x27z2": "TIL Hugh Jackman walked around Comic Con wearing his full Wolverine costume, and nobody noticed.",
    "65mnzf": "TIL Artificial intelligence (AI) systems known as ‘robo farmers’ could soon grow crops and tend livestock around Britain while their human controllers need never set foot in a field again",
    "12stw1": "TIL Scientists are currently working on a substance that could give anybody the Spiderman ability of walking up walls and ceilings.",
    "21ttir": "TIL that President Obamas Secret Service codename is Renegade",
    "2s5sc2": "TIL Elon Musk wants to build a vertical take-off, supersonic, electrical passenger jet.",
    "bsni4": "TIL that Goldman Sachs was Obama’s top Wall Street contributor during the 2008 election cycle, donating nearly $1 million to his campaign",
    "13vpv4": "TIL There is a genus of flying snakes that can launch themselves at prey",
    "jcen2": "TIL there is a website where you can listen to thousands of episodes of classic radio dramas for free",
    "1erji7": "TIL During High School, Ronald Reagan got a job as a Lifeguard and saved 77 lives there.",
    "1d425k": "TIL that Disney produced a Lizzie McGuire spin off about Miranda's sister called Whats Stevie Thinking starring Selena Gomez. But it was never picked up.",
    "xmrle": "TIL: That General Motors used to give The Mercury and Apollo series astronauts a free Corvette when they returned from space.",
    "1i5270": "TIL Comic book legend Stan Lee ends every phone conversation he has with the word \"Excelsior!\"",
    "s4uzy": "TIL That IMDB has been owned by Amazon.com since 1998.",
    "9xwuti": "TIL Joan B. Lee, wife of Stan Lee, was the voice of Madame Web in the 1994 Spiderman series. She then spoke about Stan Lee in his Spiderman series cameo.",
    "3cwqoz": "TIL: The Back to the Future DeLorean and the Star Trek Enterprise were designed by the same man",
    "uvknw": "TIL after filming The Goonies Steven Spielberg flew the entire cast to Hawaii and surprised director Richard Donner with a cookout.",
    "9jmzw3": "TIL Lebron James was so hated back in 2012 that even a captured Al-Qaeda member wrote letters expressing his disgust at his decision to go to the Miami Heat. He told his lawyer that “LeBron James is a very bad man and should apologize to the city of Cleveland.”",
    "itr85": "TIL that it's illegal to keep rabbits as pets in Queensland. Unless you're a magician.",
    "8g3t0w": "TIL in 1998, Marvel offered the cinematic rights of almost all of it's characters to Sony for a mere $25 million. Sony rejected the offer, and only purchased the rights to Spiderman for $10 million believing that movie audiences would only care about him.",
    "20fltb": "TIL that Nikola Tesla and Mark Twain were best friends and mutual fanboys",
    "3dquh7": "TIL that every sweepstakes must legally have a free method of entry, and you can get free McDonalds Monopoly pieces by mail.",
    "17s45b": "TIL that Netflix has a movie that is nothing but an hour long video of a fireplace - Fireplace for Your Home",
    "o7x91": "TIL the father of the man who assasinated Abraham Lincoln was named after the man who assasinated Julius Caesar.",
    "jvfpq": "TIL that Tom Hanks was originally cast to play Mario in the Super Mario Bros. movie.",
    "2hca6y": "TIL that Tom Cruise vandalized the world’s tallest building in 2010. During the filming of Mission: Impossible 4, he climbed to the top of the Burj Khalifa (without safety equipment) and etched Katie Holmes' name into the spire.",
    "1qbdat": "TIL that despite John Carter being considered a monumental flop for Disney, it actually broke box office records in Russia",
    "1ulgnc": "TIL President James Buchanan had a boyfriend whom other politicians referred to as \"his better half\"",
    "vk5qy": "TIL that Elton John chose Lady Gaga as his son's godmother.",
    "6whop8": "TIL after Ed Sheeran's finished his London college music course, he couch surfed for 2 and half years, slept rough outside Buckingham Palace and caught up on sleep on the London Underground between gigs in order to break his way into the music industry",
    "3koy0s": "TIL Warner Bros. threatened movie theaters with blockage of future posters if they showed a parody movie of Harry Potter",
    "w8bwu": "TIL Bender from Futurama and the Terminator both have the 6502 cpu, the same processor used in NES, Atari 2600 and C64.",
    "4naico": "TIL Weird Al Yankovic, Ice-T, Felicia Day, Sean Astin, Wil Wheaton, and several others narrated an audiobook about Dungeons & Dragons character Drizzt Do'Urden.",
    "1f8qpd": "TIL More people are bitten each year by New Yorkers than by sharks",
    "3hhaca": "TIL Tom Cruise spent two years learning Japanese and swordplay in preparation for the filming of The Last Samurai.",
    "27b7qf": "TIL President Abraham Lincoln is in the National Wrestling Hall Of Fame.",
    "9981pn": "TIL Chinese American James Wong Howe was an Oscar-Winning cinematographer who pioneered the use of wide-angle lenses, low-key lighting, crab dolly and deep-focus cinematography. He was not an American citizen until 1943 and his marriage with a white woman was illegal until 1948 due to racism.",
    "8fmayx": "TIL that Pac-Man creator Toru Iwatani wanted to turn arcades into date hangouts \"that would not be intimidating to female customers.\" Pac-Man \"appeals to a new generation of female players who have grown up empowered and want to be the pursuer rather than being the pursued.\"",
    "1t529k": "TIL that the last game made for PS2 is FIFA 14, which is also the first game to span 3 console generations.",
    "192dai": "TIL that the Director of Cinematography for Schindler's List also photographed the 1991 Vanilla Ice vehicle, \"Cool as Ice\"",
    "2eu4dc": "TIL the most popular hat in the old west was the bowler, not the cowboy hat",
    "6g7sz7": "TIL the NFL has no written rule against female players; women would in fact be allowed if they met the league's eligibility requirements.",
    "206shs": "TIL Donald Glover got his rapper name 'Childish Gambino' from an online Wu-Tang Clan name generator.",
    "3ykiqc": "TIL the first team to ever beat the Green Bay Packers was a team called the Beloit Fairies.",
    "3fvl9k": "TIL that, in order to become Governor of Kentucky, one must have never participated in a duel.",
    "gplqs": "TIL Amazon has a website that sells returned and like-new items with discounts",
    "1kaw1b": "TIL that Bulletproof clothing mogul, Miguel Cabarello, shoots all his employees in order to test and enforce quality control on his wares.",
    "1cn3dz": "TIL Trey Parker and Matt Stone got Tom Cruise kicked out of Paramount.",
    "9mvb84": "TIL Taylor Swift is two inches taller than Kanye West",
    "d09qb2": "TIL Bruno mars writes his own music.",
    "3k5tj6": "TIL that the four vultures in Disney's The Jungle Book were both designed after and originally supposed to be voiced by The Beatles.",
    "3dldzw": "TIL that the Hudson Bay region of Canada has been found to have less gravity than the rest of the Earth.",
    "kwrns": "TIL that every U.S. state with 30%+ of its population college-educated voted for Obama in 2008.",
    "yhzgb": "TIL The Walt Disney Company makes about $1,110 per second.",
    "3nkw0x": "TIL that Nintendo has such a large cash reserve it could lose $250 million every year and wouldn't go bankrupt until 2052.",
    "3nik9l": "TIL Henry Winkler ('The Fonz') has dyslexia, has written an 18-book children's series whose main character is dyslexic, and he plays the kid's music teacher in a BBC TV adaptation. The teacher is based on the one person who provided him moral support in his own schooling.",
    "2kllw5": "TIL that a 2012 study concluded that pop music has grown louder and increasingly musically homogeneous since the mid-1960s",
    "xnlkl": "TIL In the french translations of Harry Potter, Voldemort's middle name is \"Elvis.\"",
    "mi19u": "TIL That Playstation 3's only have 256MB of RAM",
    "6so022": "TIL that modern violins were preferred over million-dollar Stradivarius violins when the sound tests were blind",
    "1bp7ad": "TIL The Jurassic Park Ride Cost $110 Mil To Create Whereas The Jurassic Park Film Only Cost $63 Mil.",
    "1fmgyc": "TIL that a cat named Hank placed third in a Virginia Senate election",
    "1qnend": "TIL The Hungary national football team only had one defeat between 1950 and 1956, and that was the World Cup final.",
    "23jyvf": "TIL that Samuel L. Jackson puts a golf clause in his film contracts that allows him to play golf twice a week during production.",
    "1gr8jl": "TIL Chicago, nicknamed the Windy City, is named after the boastful loquacity of its politicians rather than the gusts that shoot between buildings",
    "22mofr": "TIL Hawaii passed single-payer healthcare in 2009, but their governor refused to implement the law",
    "1kbbce": "TIL Grant Imahara from Mythbusters created Craig Ferguson's robot sidekick Geoff Peterson",
    "gqu97": "TIL there is a 'code reddit' where everything you see on reddit appears as C# code",
    "7oc03c": "TIL That the song \"Warriors\" by Imagine dragons was created because of the League of Legends World Championship Music video",
    "1e407k": "TIL that The Flash travelled back in time, became a form of pure energy, and was the very bolt of lightning that gave him powers in the first place.",
    "511jo5": "TIL the actress who portrays Eleven's mother on Stranger Things has lived her whole life without legs.",
    "2ar0e6": "TIL Months before Apollo 11, NASA had seriously considered placing a UN instead of an American flag on the moon.",
    "62zric": "TIL Theodor Geisel became Dr Seuss after being caught drinking with friends in college during Prohibition, to continue writing on the humor magazine he had to use a pen name and went with \"Seuss\", only adding the \"Doctor\" part later on",
    "1kso6k": "TIL There is a Japanese anime based on The Powerpuff Girls called Powerpuff Girls Z",
    "5hxig0": "TIL that fan conventions are tremendously lucrative for stars of science-fiction/fantasy TV shows and films. Actors can make >$100,000 per weekend (more than their salaries) of signing autographs and getting photos taken with fans.",
    "1t1r44": "TIL: Steven Spielberg was rejected by USC film school twice. Spielberg later became a trustee there",
    "ypfdi": "TIL that 8 out of 9 developers of the hugely influential N64 game GoldenEye 007 had never worked on video games before.",
    "2obbaf": "TIL Due to differences in atmosphere, sounds on Mars have a higher pitch than they do on Earth.",
    "3nkxwq": "TIL That the Michigan State University Library has the largest publicly available comic book collection in the world",
    "1h12wi": "TIL under the provisions of the 1912 Scottish Protection of Animals Act, the Loch Ness monster is a protected species.",
    "12knzg": "TIL The shortest telegram in the English language was from the Irish writer Oscar Wilde.",
    "5liu5v": "TIL even though Spartacus had a cinematographer, Stanley Kubrick took the camera away from him and did it himself. Even though he did almost none of the work, when Spartacus got the Academy Award for best cinematography, it went to the credited cinematographer, and not Kubrick.",
    "1qoy0s": "TIL that Superman was once bitten by Dracula. But because the Man of Steel is fueled by the sun, Dracula immediately exploded.",
    "6od1sl": "TIL Michael Jackson released an audiobook/ soundtrack album Directed by Steven Spielberg for ET",
    "12bynh": "TIL that not only is there an actor named Denzel Whitaker, but he was in a movie with Denzel Washington and Forest Whitaker.",
    "1wqfa5": "TIL that in the 18th century there was a \"moral panic\" because of the spread of the reading of novels.",
    "359zom": "TIL that you can get \"ecclesiastical clothing\" designed by Armani, Gucci or Prada for as little as $2000.",
    "2yjxql": "TIL: There is a book called \"Becoming Batman: The Possibility of a Superhero\" written by a neuroscientist, which covers in detail how much an ordinary person would need to train and adapt to become Batman.",
    "18ny0y": "TIL Starship Troopers is the first sci-fi novel on the reading lists of three of the five US military branches",
    "3gry38": "TIL when Earth was first formed a day was only 5.5 hours long",
    "9a1lee": "TIL prior to 1963 it was not uncommon for students in the US to be required to read from The Bible as part of their elementary education. A lawsuit that went all the way to the Supreme Court, ended the practice that year.",
    "3c77gi": "TIL The American team has never placed below third place in the World Cup since women's World Cup started in 1991",
    "5slmqr": "TIL an inventor trying to make a sock to prevent trench foot first produced modern water balloons. Having made a latex-coated sock and filling it with water to test for leaks, he found a rip and angrily threw it on his table. Pleased with the splash, he decided to market water balloons for children.",
    "9jm7xm": "TIL research suggests playing Tetris can give a “quick and manageable\" fix for people struggling to stick to diets, or quit smoking or drinking.",
    "9whghb": "TIL Stan Lee was planning on changing careers when he was assigned to come up with a new superhero team. Since he had nothing to lose, he experimented with stories he preferred. This resulted in co-creating Fantastic Four, Hulk, Iron Man, Spider-Man, X-Men, Thor, Doctor Strange, Daredevil, Avengers.",
    "2369wj": "TIL that Australian fictional character Dame Edna Everage's \"autobiography\" My Gorgeous Life is classified as non-fiction",
    "1awxbe": "TIL Evel Knievel sued Kanye West over damage to his reputation from the 'Touch the Sky' music video.",
    "3ow5sv": "TIL Babe Ruth was caught stealing to end Game 7 and lose the 1926 World Series with his team down by one run.",
    "2phugh": "TIL The actor who played Ralphie in \"A Christmas Story\" was the executive producer of \"Iron Man\"",
    "2frem2": "TIL Canada is the only country in the world with two national sports, Lacrosse and Ice Hockey.",
    "1jjb4w": "TIL the estate of Albert Einstein earns $18,000,000 annually-- more than John Lennon and Marilyn Monroe combined",
    "kvplq": "TIL scientists have voted \"We Are The Champions\" the catchiest pop song of all time.",
    "qlvl0": "TIL There is a poem when read normally is depressing, but when read backwards is inspiring.",
    "2fmu5d": "TIL that the cat that featured in The Godfather purred so loudly that some of Marlon Brando's dialogue had to be re-dubbed",
    "3fir89": "TIL that after gaining 40 lbs because his then girlfriend Anna Faris was a really good cook, Chris Pratt lost 30 lbs to get the role of Scott Hatteberg in Moneyball",
    "18eqhc": "TIL that in Star Trek, Spock was supposed to be a female character but was changed during the show's production",
    "2n6765": "TIL Denis Cyplenkov, an arm wrestling champion and bodybuilder, has the biggest and most densely muscled hands in the world",
    "3epffx": "TIL: In January 2007, Serena Williams was ranked 95th in the world. She went on to win the Australian Open against Maria Sharapova.",
    "1fv59m": "TIL Google purchased the domain name Gmail.com from Garfield Comics.",
    "1m8ywb": "TIL Stanly Tucci is an incredible cook, and even made Meryl Streep cook with him to prepare for Julie & Julia.",
    "2f3pok": "TIL that some in the professional tennis circles consider \"grunting\" before a shot to be a form of cheating",
    "2fa2n2": "TIL there is a water vapor cloud in space which has 100 trillion times the amount of water present on Earth.",
    "mlqmv": "TIL that the army use Xbox 360 controllers to fly UAV spy planes",
    "jj27g": "TIL Christopher Walken was considered by George Lucas for the part of Han Solo in Star Wars",
    "1xbnpc": "TIL that there is an asteroid with its own moon in our solar system",
    "34yru9": "TIL that in 1908, a law was passed limiting the length of hatpins out of fears that suffragettes would use them as weapons.",
    "15pufz": "TIL that the first space shuttle, the Enterprise, was named after the star ship from Star Trek thanks to a write-in campaign.",
    "8bldo9": "TIL that the game Grand Theft Auto 5 is being used to advance the AI of self-driving cars.",
    "mytcj": "TIL there is a banned swimsuit so good that 94% of all swimming races at the 2008 Olympics were won in it",
    "k3ob1": "TIL Lady Gaga was on MTV's \"Boiling Points\" before she was famous.",
    "oc7k0": "TIL Nintendo released a handheld console specifically for Pokemon in 2001.",
    "2cotbg": "[deleted by user]",
    "8m173l": "TIL Shakespeare coined or popularized many of the phrases we use today. Some of these include: “Good riddance. In my heart of hearts. Laughing stock. Wild-goose chase. Devil incarnate. Brave new world. As luck would have it. All our yesterdays. Break the ice. Full circle.”",
    "x5n9t": "TIL Starship Troopers is the only science fiction novel recommended by three of the five branches of the US military.",
    "1yxaxc": "TIL dogs and elephants are the only animals that seem to instinctively understand pointing",
    "pze1s": "TIL The Department of Defense worked on Transformers 2 for more than a year.",
    "2almam": "TIL that during the 2012 US elections international electoral observers were blocked from the polls in nine states",
    "qy9hq": "TIL that if you watch a horror movie before you view abstract art, you will enjoy the art more",
    "84wc1b": "TIL Disney does not own the rights to show \"big\" Marvel characters (Avengers, X-Men, Spider-Man, etc) in theme parks east of the Mississippi, due to a contract Marvel signed with Universal Studios in the 90s",
    "143o3l": "TIL that rapper Big Sean had a GPA of 3.7 and turned down a scholarship to Michigan State before being signed by Kanye West",
    "7y9s1g": "TIL Ariana Grande’s anthem to female empowerment, ‘Dangerous Woman,’ was written by three men. The R&B/pop song was also originally pitched to Carrie Underwood as a country song.",
    "1e0esq": "TIL that Albert Einstein was asked to be the president of Israel, which he declined.",
    "3w3hwc": "TIL that the 1929 Science Fiction Film \"Woman in The Moon\" influenced the space program as we know it today. The \"Countdown\" used for rocket launches originated with this German silent film. Other influences include the use of a launch pad, G-force requirements, and modern multistage orbital rockets",
    "2prac8": "TIL Disney's \"Treasure Planet\" was one of the most expensive box office flops of all time",
    "t2klf": "TIL Dizzy Gillespie ran in the 1964 presidential race with a cabinet made up of all the biggest names in jazz.",
    "39sgf2": "TIL Russell Brand was eligible to claim $22 million after divorcing Katy Perry, but declined.",
    "czeu7w": "TIL Pakistan has a jazz orchestra that is currently topping the charts.",
    "3ki6hq": "TIL that the first cloned pet was a cat and it's name was Copy Cat",
    "52g8zv": "TIL Albert Einstein was also a gifted musician, playing both the piano and violin with exceptional skill. He once said: \"The greatest scientists are artists as well.\"",
    "1owxtz": "TIL Youtube is the second largest search engine on the net.",
    "1l2tz2": "TIL J.P. Morgan bailed out the U.S. Government in 1895",
    "11so82": "TIL that Mythbuster Grant Imahara is a steampunk style fashion model.",
    "1pro05": "TIL if all of Canada was one state in the US, it would have 50 electoral votes -- fewer than California.",
    "9whgi0": "Today I learned that Stan Lee, along with Dr Seuss and Frank Capra, served as one of nine army playwrights during WW2.",
    "p0n3l": "TIL that John Williams has been nominated for more Oscars than anybody except Walt Disney.",
    "3bwea8": "TIL Albert Einstein Was A Member Of The NAACP",
    "19tokf": "TIL there's a sequel to Charlie and the Chocolate Factory and it has aliens and space travel in it.",
    "1r57gh": "TIL Linda Hamilton actually picked the locks on her harness and on the door in the mental hospital in Terminator 2",
    "x1c9b": "TIL that in 2001, Neopets was the fourth most trafficked website on the internet, 8 spots in front of Google.",
    "1spw18": "TIL Kiss bought into an Arena Football team and offered a contract to Tim Tebow",
    "87p827": "TIL when Justin Bieber was 15 he was on an episode of MTV's Silent Library",
    "2a4pjv": "TIL Adam West has a Batman Logo on one of his molars",
    "78rz37": "TIL that the release of Gone With the Wind on December 15th, 1939 was so big that the mayor of Atlanta declared a 3-day festival that concluded with a state holiday on the day of release.",
    "22meba": "TIL Anytime you see an ingredients list that includes carmine, cochineal extract or natural red 4, the product contains crushed up bugs.",
    "5wxcl2": "TIL Christopher Robin was a real boy who befriended Winnie, a black bear at the London Zoo, named after Winnipeg, Canada, by a Canadian soldier who bought a real bear cub and took him to Europe during WW1.",
    "toxvn": "TIL-Tom Hiddleston, who plays Loki in the Avengers, screen tested for the role of Thor. He went on a strict diet and gained 50 pounds of muscle. They later decided he would be better for the role of Loki.",
    "3m581q": "TIL that George Hotz, then 17 years old, was the first to unlock a first generation iPhone and sold the iPhone for a Nissan 350z and 3 locked iPhones.",
    "2yg3pz": "TIL Leonard Nimoy fought to get pay equity for Nichelle Nichols on Star Trek in the 1960s",
    "cc84ou": "Saadat Shahr, a small rural community in Iran nicknamed ‘Astronomy Town’ because of the residents’ passion for stargazing. The town clubbed together to pay for an observatory and on special occasions all the lights are cut to improve the view of the night sky. [OP is u/aryaschahin on r/iran]",
    "sc9i4": "TIL the Javanese alphabet, when recited in order, forms a poem",
    "3w2fm9": "TIL Baker Mayfield (quarterback, University of Oklahoma) once considered quitting football to pursue full-time competitive gaming, and claims to be able to beat anyone at the University of Oklahoma one-on-one in Halo 3.",
    "6wlsro": "TIL that Lady Gaga's music video for \"Telephone,\" earned a Guiness World Record for \"Most Product Placement in a Music Video.\"",
    "3jvzn0": "TIL that professional ballet dancers can go through 4 pairs of pointe shoes in a week.",
    "1a001e": "TIL the Olsen Twins purchased sole ownership of an entertainment company in 2004 and turned it into a billion-dollar enterprise.",
    "10j4tv": "TIL Antarctica has a disc golf course.",
    "2v499d": "TIL the items in Mario Kart are not completely random. First place players will get small defensive items, and last place players may get a more powerful item like a star.",
    "1ges7c": "TIL the origins of the conical party hat was derived from dunce caps. They were worn at parties to encourage foolish behavior.",
    "1cb0vy": "TIL rapper and producer Jay-Z has a patent for his own color called 'Jay-Z Blue'",
    "4z4gj4": "TIL that The Fault in our Stars by John Green was (in part) inspired by a real YouTuber by the name of Esther Earl who passed away at age 16.",
    "1iab4m": "TIL Mortal Kombat II was the first game to surpass Hollywood box office sales",
    "2uhg6q": "TIL New England Patriot Sebastian Vollmer is the first German citizen drafted into the NFL",
    "380su4": "TIL John Green, author of The Fault in Our Stars, hosts an educational YouTube series called Crash Course that deals with a wide range of topics including History, Science and Economics.",
    "46uw06": "TIL Adele's 'Make You Feel My Love' was written by Bob Dylan in 1997",
    "322w8n": "TIL Daft Punk produced an anime movie exclusively featuring their music to promote their album \"Discovery\".",
    "17bz03": "TIL Youtube began as a dating website.",
    "1iz1v8": "TIL there are 10 huge glitches/shortcuts in Mario Kart 64 that can shave minutes off your lap times",
    "1mxtxo": "TIL that no film based on a video game has achieved above 44% on rotten tomatoes.",
    "zmaqj": "TIL the Minecraft World is bigger than Neptune!",
    "1cmvvj": "TIL that there are more people on Facebook than there were people in the world 200 years ago.",
    "1xahru": "TIL animals from geographically distant areas often speak different \"languages\" or \"dialects.\"",
    "2do532": "TIL That Nevada is the only state to have a \"None of these Candidates\" voting option for Presidential elections.",
    "56iix5": "TIL the oldest known surviving pair of socks were designed to be worn with sandals.",
    "x66t4": "TIL the father of the modern Olympics won one gold medal. In literature. For writing a poem about sports.",
    "5dws2a": "TIL Gucci cosmetics, Tide, Braun and Iams are all owned by the same company, Procter & Gamble",
    "1lokf0": "TIL that the creator of Atari also created Chuck E. Cheese as a way to get kids to play Atari video games.",
    "1jhs7x": "TIL that a mysterious mute man was found wandering the streets in England in 2005 and could only communicate via piano",
    "9lhco0": "TIL The original lightsaber prop used in Star Wars by Mark Hamill as Luke Skywalker is inside the International Space Station and was flown by STS-120 last August 2007",
    "1bl8a5": "TIL rapper Tupac Shakur's music is in the Library of Congress of \"cultural significance.\"",
    "22oy3m": "TIL that the Nokia company originally got big by making rubber boots. In the 1800's. They still make rubber boots.",
    "2ee9jv": "TIL that the reason Blade Runner depicts the LA of 2019 with a Japanese dominated culture and corporations is due to the popular 1980s prediction of the United States being economically surpassed by Japan",
    "1c4mni": "TIL Bill Nye \"the science guy\" got his break in entertainment by winning a steve martin lookalike contest.",
    "iimdp": "TIL that the LAPD asked Lady Gaga to tweet her 11.4 million followers information about some upcoming roadwork.",
    "9imub": "TIL That the little arrow next to the pump symbol in your car represents which side your gas cap is on.",
    "5zur3c": "TIL Beauty and the Beast was the first animated movie to be nominated in the best picture category at the Oscars",
    "1kd7r6": "TIL Arya Stark from Game of Thrones was Maisie Williams' first role in anything",
    "2tf2w8": "TIL that at the 2014 World Cup, there were more French-born players playing against France than for it.",
    "2xahcf": "TIL the richest superhero is actually Black Panther, who has an estimated of $500 billion, whereas Tony Stark is worth $100 billion and Bruce Wayne $80 billion",
    "604cri": "TIL Spain is the only country that has been a permanent guest at every G20 summit, but they have a government's policy to not request official membership",
    "767g44": "TIL that Spider-Man has a hyphen because Stan Lee did not want him confused with Superman.",
    "8n9nz9": "TIL The late great musician Prince was a fantastic bowler who could 'throw a strike at will' and wore knee high furry boots while he was doing it",
    "28vbiz": "TIL there was only 1 group in World Cup History to end with a 4-way tie",
    "9an5nz": "TIL that Dr. Seuss pronounced his name so that it rhymes with \"voice\".",
    "2942bh": "TIL Parents at Depew High School wanted to ban John Green's Looking For Alaska because they believed it was \"pornographic\". One parent refused to read the book claiming \"One does not need to have cancer to diagnose cancer\".",
    "3892b2": "[deleted by user]",
    "14xxfl": "TIL Pilgrim clothing was full of color. They only wore black for special occasions.",
    "2s2s1c": "TIL The Green Bay Packers are the only community owned, not for profit major franchise in American professional sports",
    "53zok7": "TIL Hollywood uses a measurement called Q scores to determine the likability of celebrities. The highest ranking celebrities include Tom Hanks and Morgan Freeman with 48 points, while Kim Kardashian was determined to have to lowest Q score with -71.",
    "17gt4m": "TIL The Ottoman Empire was still in existence the last time the Chicago Cubs won the World Series.",
    "2k7bmt": "TIL an elementary school replaced desks with \"reading bicycles\" and test scores skyrocketed.",
    "3jdq1d": "TIL There are animals which can theoretically live forever because they are 'biologically immortal' including a type of jellyfish and lobster",
    "3q6csd": "TIL a 14 karat gold LEGO brick was given out in the early 80s to employees who had worked at the Germany LEGO factory for over twenty-five years. They are valued at nearly $15,000.",
    "5ma57n": "[deleted by user]",
    "3wy6hd": "TIL that in Lionel Messi's hometown of Rosario in Argentina it is no longer allowed to name a kid Messi. Many people in the city have the Messi Surname, and they wanted to prevent a lot of kids suddenly being named after him, or the name Messi Messi becoming common.",
    "3lnygs": "TIL that the term soap opera originated from such dramas being typically sponsored by soap manufacturers in the past.",
    "2y4lyi": "TIL that the Curiosity robot on Mars, sent by NASA, sings Happy Birthday to itself on its birthday",
    "6ewok9": "TIL Jack London lived as a pauper among 500,000 destitutes for several months in the poorest sections of London. His 1903 non-fiction book The People of the Abyss exposed the gap between the rich and the poor at the height of the British Empire.",
    "27pcu7": "TIL that Nike Air Jordans account for 1 in every 3 dollars spent on sneakers on Ebay",
    "7m5kll": "TIL that recordings of various wild animals were used to make Chewbacca's voice.",
    "2f2ubm": "TIL 7% of people read the full terms when buying a product or service on the Internet.",
    "9tvysu": "TIL that Margaret Mitchell, author of Gone with the Wind, did not learn that the South lost the Civil War until she was 10 years old.",
    "11cfot": "TIL Amazon holds a patent on 1-click buying; Apple pays them licensing fees",
    "ldrkg": "TIL Native Americans introduced the front crawl swimming stroke to the West when they beat the British who only used the breaststroke.",
    "1ufm68": "TIL when Schwarzenegger was governor of California, he never lived in Sacramento. Instead he commuted 3 hours everyday... by private jet.",
    "1pzity": "TIL that there are three subway lines exlusively for congressmen to move between the Capitol and the House and Senate offices",
    "29brgl": "TIL: There is a deep-water fish called the Black Swallower (or great swallower) that can swallow whole fish twice its length and up to ten times it mass.",
    "98k4he": "TIL The Amazing Spider-Man 2 is the only Spider-Man film that has been shot entirely in New York, which is the character's hometown.",
    "3nd3mr": "TIL the average American golf course consumes around 312,000 gallons of water per day.",
    "3ohv5f": "TIL the inventor of the dial telephone was an undertaker who was convinced telephone operators were rerouting his calls to rival businesses",
    "p2u7b": "TIL Freddie Mercury wrote \"Crazy Little Thing Called Love\" in 10 minutes as a tribute to Elvis Presley.",
    "tdl68": "TIL Playstation 3's are being used to research black holes",
    "2tofpe": "TIL Politicians in Kentucky must swear an oath that they've never participated in a duel before taking office",
    "14sl0n": "TIL that White Star crewmembers on the Titanic were considered fired as of the moment it sank",
    "plhhl": "TIL that when Barack Obama visited India, all the coconuts in the trees surrounding one of his destinations were removed, just in case",
    "59fvxs": "TIL The Flash had an unofficial run in the Marvel universe when a blonde speedster in a red suit appears from another dimension. He can't remember his real name, only that is sounds like \"Buried Alien\"",
    "i4jbo": "TIL that dogs drink with the underside of their tongue",
    "1ig82s": "TIL when a cat reaches 15 years old it has usually spent 10 years of its life sleeping",
    "26wfq5": "TIL that Monaco eliminated income tax in 1869 because the revenue of the casino was sufficient to sustain the principality's government",
    "14ski8": "TIL that as a young actor Denzel Washington played \"Grapes\" in Fruit of the Loom commercials",
    "3li5fo": "TIL that Suzanne Collins, author of the Hunger Games, got her start writing for Clarissa Explains It All on Nickelodeon.",
    "9adeyt": "TIL Muse's Matt Bellamy used his iPhone to record his unborn son's heartbeat, and later used that recording in the song Follow Me",
    "5egdlz": "TIL that the Prime Minister of Australia's position isn't in the Constitution and exists only through custom.",
    "37vtcz": "TIL that Messi was given performance enhancing drugs as a kid because doctors predicted that he wouldn't grow taller than 4'7\".",
    "1jog4t": "TIL The Beatles' three-month stay atop the Billboard Hot 100 in 1964 was ended by jazz legend Louis Armstrong",
    "7x75mv": "TIL that the masks the Incredibles wear are called Domino Masks",
    "47mwqn": "TIL Taylor Swift donated all the proceeds from Wildest Dream to African wildlife conservation.",
    "3lxch4": "TIL Phil Collins recorded the English, Italian, German, Spanish, and French versions of the Tarzan soundtrack",
    "26nv9r": "TIL in 39 out of 50 states, the highest paid state employee is either a college football or basketball coach.",
    "1vr4kt": "TIL there's a school in Sweden with compulsary Minecraft lessons",
    "1cca3h": "TIL a D.C. judge sued a small dry cleaning business for over $67 million for the loss of a pair of pants.",
    "2f66wx": "TIL: The Kim Jong-il statue in Team America is actually just a real person in makeup standing very still.",
    "kp12w": "TIL Photuris lightning bugs mimic the blinking patterns of other species of lightning bugs in order to attract and eat them.",
    "7lkm8y": "TIL the Star Wars saga IMDB scores in chronological order: I (6.5), II (6.6), III (7.6), Rogue One (7.8), IV (8.6), V (8.7), VI, (8.4), VII (8.1), VIII (7.7). It rises with each movie, peaks with V and starts to decline again.",
    "27d8o7": "TIL: Because Nintendo owns the Seatle Mariners, there is a 3DS app that allows you to order food direct to your seat",
    "1myca7": "TIL Louis Braille, the inventor of the reading and writing system for the blind Braille perfected it when he was just 15",
    "qei8d": "TIL Johnny Depp is producing and possibly starring in a biopic about the life of Theodor Geisel, aka Dr. Seuss.",
    "3tdebj": "TIL By law, no United States officer is allowed to outrank George Washington, who posthumously became a six-star general.",
    "837urr": "TIL: Woman are more likely to own iphones than men",
    "1e7qc8": "TIL: Cristiano Ronaldo has scored 146 goals in 135 for Real Madrid, which amounts to at least one per game in over 4 years..",
    "54a6wy": "TIL Stranger Things was allegedly based on Project Montauk, a supposed secret government program involving the kidnapping of children for use in mind control experiments.",
    "r24s1": "TIL Greenland can't join FIFA because not enough grass grows there for a soccer field.",
    "24n6c8": "TIL That musicians need to \"play-in\" a violin to ease its harshness, before it's used in a performance. Musical vibrations alter the structure of cellulose molecules in the wood, and change the internal resonances of the body",
    "2arbaw": "TIL \"Game designer Jane McGonigal calculated that as a planet we play three billion hours of video games a week.\"",
    "30t86t": "TIL humans are unable to burp in zero gravity environments.",
    "p19ua": "TIL Tom Hanks wasn't paid for Forrest Gump. He took took a percentage points which earned him over $40 million dollars",
    "27yvqv": "TIL Americans call it \"soccer\" because it was slang for asSOCiation football",
    "1hnv5w": "TIL the writers for Superman did not name their super-villain after a pre-existing word - they actually coined the term \"Brainiac.\"",
    "czqsod": "TIL Christopher robin milne, the individual on which the winnie-the-pooh stories were based, married his first cousin.",
    "3ljt5y": "TIL Sharks evolved earlier than Dinosaurs and Trees",
    "8r3uic": "Today I Learned James Cameron in the mid 1990s was set to make Spider Man film staring Leonardo DiCaprio and Arnold Schwarzenegger but was cancelled.",
    "1z32f4": "TIL 'The Empire Strikes Back' was nominated by the Writers Guild of America for its Best Comedy award in 1981",
    "l73un": "TIL Megatron was the Leader of a Civil Rights group on Cybertron that wanted Equal Rights for all robots.",
    "lzx4g": "TIL Typing \"Askew\" into Google will make the page tilted.",
    "3yzrz6": "TIL there is a rare fiber called Cervelt that is produced by New Zealand red deer and is softer than cashmere. Only 20 grams of this fiber can be collected yearly per deer and it is used to make luxury socks that cost $1,500 a pair.",
    "2zahn8": "TIL that the dinosaurs in Jurassic Park only appear in the film for 15 minutes.",
    "8i2mmg": "TIL it took Ryan Reynolds 11 yrs to get his vision of \"Deadpool\" made. The project overcame the failing of \"X-Men:Origins\" and persevered to become the highest grossing R-rated film of all time.",
    "1f9tfv": "TIL There is a whole subculture dedicated to finding \"Hidden Mickey Mouse\" images in all things Disney",
    "23lbas": "TIL that only two Youtube vidoes have more than a billion views. They are: \"Gangnam Style\" by Psy, and \"Baby\" by Justin Bieber featuring Ludacris.",
    "3pj6vl": "TIL in 2002 three NASA interns stole moon rocks and tried to sell them in Belgium. Did not end well for all involved.",
    "5b7n5k": "TIL that the Marvel Comics character Black Panther was not named after the Black Panther Party, and Marvel's use of the name actually predates the founding of the party. In fact, the character's name was briefly changed to \"Black Leopard\" in order to avoid confusion with the controversial group.",
    "4mqooc": "TIL Seth Curry and Mychel Thompson, brothers of Steph Curry and Klay Thompson, played in the back court together on the Santa Cruz Warriors in 2013, while Steph and Klay did the same on the Golden State Warriors",
    "3jqnin": "TIL Despite being released over 40 years ago, The Dark Side of the Moon was still one of the best-selling albums of 2014.",
    "3adnql": "TIL Daniel Day-Lewis is the only Actor to win Best Actor at the Oscars 3 times.",
    "35mqba": "TIL that NBA MVP Stephen Curry was held scoreless once when playing for Davidson, when the other team kept two defenders on him all game as Curry stood in the corner. Davidson (Curry's team) won 78-48.",
    "3qjfnd": "TIL that Tony Stark's JARVIS stands for \"Just A Rather Very Intelligent System\".",
    "ib00c": "TIL That rapper Busta Rhymes voiced the Reptar wagon in the 1998 Rugrats Movie",
    "1l46kh": "TIL the circular huddle used in todays American Football was created by Paul D. Hubbard, a deaf quarterback, so the other team could not read his hand signals.",
    "4df0oy": "TIL the Flash has moved and ran so fast, that he was capable of outrunning and defeating death itself (the Black Flash) by outracing it to the end of time/space, past entropy, the next Big Bang and into the next Universe.",
    "3k77p6": "TIL 3rd Rock from the Sun won the Golden Globe for Best Comedy Series in 1997, beating Seinfeld, Friends, and Frasier.",
    "2zl2v2": "TIL it is not legal to \"own\" pets in Boulder, Colorado, but you may be their \"guardian.\"",
    "3f8xio": "TIL J.R.R. Tolkien considered Samwise Gamgee to be the \"true hero\" of the Lord of the Rings",
    "xo9f0": "TIL a Mars colonization project planned for 2023 will be funded by creating a reality TV show.",
    "10gchz": "[deleted by user]",
    "35163l": "TIL that due to the success of their debut album, Linkin Park played 324 concerts in 2001 alone.",
    "1bppu8": "TIL Google created a network that watched 10M Youtube clips, it learned to recognize cats.",
    "2zwg2v": "TIL the direction of Earth’s magnetic field reverses every 200,000 - 300,000 years",
    "p9cy3": "TIL that the FDA burned six tons of literature in an act of US censorship",
    "2qfq4n": "TIL the DC from DC Comics stands for Detective Comics, so their company name is redundant.",
    "3a7k6q": "TIL the soundtrack for The Princess Bride was composed entirely by Mark Knopfler, lead singer and guitarist of Dire Straits",
    "12eezd": "TIL that Tolkien constructed the grammar and vocabulary of not only one, but at least fifteen Elvish languages and dialects.",
    "99ipia": "TIL James Earl Jones spent only 2.5 hours recording all of Darth Vadar's lines for Star Wars and was paid $7,500",
    "35nn8x": "TIL NBA player Klay Thompson was the 11th overall pick in the 2011 Draft, and he currently wears #11 for the Golden State Warriors.",
    "16dwpq": "TIL Daniel Craig was brought to tears when he first heard Adele's 'Skyfall' theme",
    "1h9xvp": "TIL at one point, the Superman character had the power of facial contortion, allowing him to disguises himself as anybody.",
    "26omdw": "TIL North Korea has theme parks. They are undergoing renovation at the orders of Kim Jong Un.",
    "19zghj": "TIL there are stars in the known universe that are cold enough to be touched by the human hand",
    "37jk72": "TIL there is a Pac-Man themed restaurant named Level 257 (referencing the infamous kill screen at level 256)",
    "345q8b": "TIL the rapper Tupac Shakur went to the Baltimore School of The Arts where he studied ballet, acting, poetry, and jazz.",
    "12fxyv": "TIL babies spontaneously dance when they hear music, and smile more when they hit the beat",
    "2yfr0o": "TIL: The Slo-Mo theme you hear in the movie Dredd was based on a Justin Bieber song that had been slowed down 800 times",
    "2zzr90": "TIL Scientists recovered soft tissue and blood vessels from a T. rex dinosaur",
    "1pkdyu": "TIL Crocodiles are more closely related to birds than they are to snakes and lizards",
    "1cdp5c": "TIL with over $8.5 billion worldwide film earnings, Tom Hanks is the highest all-time box office star.",
    "rmbwq": "TIL that the infamous Batman's growl in The Dark Knight is not Bale's fault but Nolan's.",
    "3dvhe9": "TIL 6 of the past 15 US presidents have been left-handed, and Ronald Reagan was ambidextrous",
    "2bnq95": "TIL that there is a Nat Geo Wild show called Game of Lions that follows the lives of lions like Game of Thrones characters.",
    "vu477": "TIL there is a type of competitive swimming where the athlete has their hands and legs bound, and swims like a dolphin.",
    "9k5htx": "TIL that after hearing Eminem’s verse on Drake’s song Forever, Kanye West took two days and cancelled appointments to rewrite his.",
    "14jtlr": "TIL that Chris Nolan's son played Cobb's son in Inception, and his cousin played the flight attendant",
    "m647d": "TIL You can build a portable Xbox 360 Laptop.",
    "1ckhyp": "TIL that Super Size meals were first called Dino-Sized meals and were introduced by McDonalds in cross promotion for Jurassic Park.",
    "14yw3v": "TIL Disney used a special multiplane camera to make their older films like Bambi more realistic",
    "7nhl2d": "TIL if you publish a book in Norway, the government will buy 1000 copies (1,500 if a children's book) and distribute them to libraries throughout the country.",
    "10vliw": "TIL that more than 80 percent of the Earth’s natural forests have already been destroyed",
    "14oiwy": "TIL that Johnny Depp and Queen Elizabeth are related",
    "32iebw": "TIL that United States Postal Service has a contract with Amazon to deliver your packages on Sunday.",
    "qguv6": "TIL that the President of Indonesia has released 3 pop albums while in office",
    "194skl": "TIL that Harry Potter books were translated from British to American English.",
    "70q7aw": "TIL that when you turn 100 in Japan, the Prime Minister sends you a silver cup to celebrate. So many people are turning 100 that they had to find a way to make cheaper cups.",
    "24u0lm": "TIL there are at least 17 ways to tie your shoes",
    "1h1kvv": "TIL all elections in Oregon are conducted by mail",
    "4i709e": "TIL that Kim Kardashian used to be Paris Hiltons personal assistant, she used to travel with her as her stylist, and at the same time she was taking notes on how to become the next Paris Hilton",
    "1mrho3": "TIL Vermont is the only state in the USA to not have a Target store.",
    "occ06": "TIL Stephon Marbury promoted a line of shoes that retailed at $15. He was not paid to endorse them.",
    "9hq24i": "TIL: \"Cat Mysteries\" are a popular genre of fiction that involve cats as main characters solving crime.",
    "1ck0a7": "TIL that according to Rotten Tomatoes, the Toy Story trilogy is the most critically acclaimed trilogy of all time.",
    "10v0yz": "TIL Monopoly is so firmly capitalist that it was once banned in Russia and China and is still outlawed in North Korea and Cuba",
    "6s0iuj": "TIL that is 2007, Roger Federer and Rafael Nadal competed in tennis on a special court which was half clay and half grass.",
    "ytgh1": "TIL that in 1953 Sir Winston Churchill won a Nobel Prize, and it was in Literature, not Peace.",
    "19pi67": "TIL Tom Cruise made $75,000,000 from a single movie: Mission Impossible III",
    "1bti19": "TIL a Chicken Mcnugget that looked like George Washington sold for $8,100.",
    "yktbm": "TIL that there are scientists who theorize that universes evolve through natural selection much like different species do on Earth.",
    "z5q17": "TIL that John McCain's mom is still alive and took race-car driving classes in her late 90s.",
    "16a3nt": "TIL upon first hearing the Jaws theme, Steven Spielberg thought John Williams was joking.",
    "7uzjk2": "TIL the US military developed special cold weather boots called Bunny Boots which feature a full inch of wool lining. Each boot weighs 1.5kg and they can be used in -58C temperatures.",
    "1z17ic": "TIL Arnold made $75,000 for his role in Terminator, but in Terminator 2 he made $15,000,000 7 years later.",
    "2vamud": "TIL Lipizzaner horses, known for their classical dressage performances, are born black or brown and take about 6 years to turn completely white",
    "1ouxaw": "TIL Elon Musk and SpaceX Want to send American families to Mars by 2025",
    "3nq8d6": "TIL Cristiano Ronaldo Makes $2.51 Per Second",
    "36yhiq": "TIL Steven Spielberg played the clarinet in the Jaws soundtrack.",
    "166u8f": "TIL Elvis Presley only ever failed one class, music.",
    "517dz1": "TIL that Spy Kids 3-D: Game Over featured George Clooney, Sylvester Stallone, Steve Buscemi, Selena Gomez, Elijah Wood, Emily Osment, and Danny Trejo",
    "16iynv": "TIL that aside from a Golden Globe in 2004, Leonardo DiCaprio has never won any major awards for his work",
    "1be13j": "TIL the last time a republican was elected president without a nixon or bush on the ticket was 1928",
    "1dcmpo": "TIL that soccer makes more money than football, basketball, baseball, golf, tennis and hockey combined.",
    "3f6mab": "TIL Before Google launched Gmail, \"G-Mail\" was the name of a free email service offered by Garfield's website.",
    "1qa8is": "TIL Jay-Z's comeback album \"Kingdom Come\" was named after the DC Comics miniseries \"Kingdom Come,\" which is set in the future and is about a retired Superman coming back out if retirement to show the new young superheroes how it's done.",
    "9g5w49": "TIL Basketball Player Tim Duncan was almost an Olympic level swimmer but had to quit due to Hurricane Hugo destroying his practice pool forcing him to practice in the Ocean, he quit soon after due to his fear of sharks",
    "3421ho": "TIL that Lady Gaga's name came from a predictive text glitch that changed radio to lady.",
    "8osbvp": "TIL that Lebron James rejected a $10 million offer from Reebok when he was just 18. When asked why, he said that Nike or Adidas might offer him a bit more. Less than a year later, he accepted a $90 million offer from Nike.",
    "7wgyyy": "TIL Transformers: The Last Knight has aspect ratio changes throughout the film, often randomly, mid-scene and between shots. The film's trailer itself includes shots of 8 different ratios.",
    "1v09uz": "TIL that an aluminum grand piano was built for the lounge of the airship Hindenburg. It weighed only 356 pounds.",
    "myh3e": "TIL that the same guy has been responsible for all of the music in every Mario and Zelda game since 1984.",
    "uuvo1": "TIL in 2011 a computer composed a piece of contemporary classical music.",
    "1asr6m": "TIL: A sequel to Stephen King's The Shining, called Doctor Sleep, has been presold to select fans for $500",
    "13ly7w": "TIL Mortal Kombat is the reason for the rating system in video games..",
    "1t3m32": "TIL: That in the 1976 Olympics 14 year old, Romanian Nadia Comaneci scored the first ever perfect 10 in gymnastics. It was such an unprecedented event the scoreboard only went to 9.8... She went on to score 7 Perfect 10's upsetting the USSR and winning the Gold. (Video of her perfect 10 inside)",
    "33ceyz": "TIL that Jurassic World was originally going to be about Human-Raptor hybrid soldiers.",
    "1mzc3q": "TIL an African tribe still wears Victorian clothes, the style of former German occupiers that they've made their own",
    "33hkvf": "TIL the Green Bay Packers are named after the Indian Packing Company, who paid for their first uniforms on the condition the team be named after them.",
    "2qjw59": "TIL when Steven Spielberg rode Jurassic Park the Ride on opening day he requested that he was let off before the 84 foot drop",
    "1oqfjs": "TIL that Warner Bros built a gym for Michael Jordan to run pick up games and practice on during the filming of Space Jam.",
    "1fxk1s": "TIL Serena Williams voiced a small character in Avatar: The Last Airbender",
    "99kl5a": "TIL that all ships visiting the ancient city of Alexandria were obliged to surrender their books for immediate copying. The owners received a copy and the originals were placed in the Library of Alexandria",
    "61aun9": "TIL Beauty and the Beast could be based on the real life story of Petrus Gonsalvus, a 16th century royal with a condition that covered his entire face and body in hair, who married a beautiful Parisian woman named Catherine.",
    "x5vhe": "TIL There is 3G cell service and internet capabilities at the peak of Mt. Everest.",
    "24ga6k": "TIL that the word 'brainiac' was derived from the DC comics super villain Brainiac from the superman series, not vice versa.",
    "7rlxjj": "TIL that one of the first learning machines, the Perceptron, was invented in 1957 and served as a basic model for future neural networks",
    "qhgrf": "TIL The Ramones played a total of 2,263 concerts...they toured almost non stop for over 20 years",
    "2yo9za": "TIL that during the first moon landing, the average age in the mission control room was 28.",
    "27f6m5": "TIL Moon Dust cuts through kevlar-like material and is harmful to humans, causing a disease called Moon Hay Fever",
    "1ueroi": "TIL The United States has more golf courses than the rest of the world combined.",
    "3sbdng": "TIL that the movie Trojan Wars with a budget of $15,000,000 has earned only $309 in box office",
    "36r9c1": "TIL of Brian Jungen, an artist who made art exhibits made to look like Canadian aboriginal masks, from Nike Air Jordans",
    "41ry0a": "TIL that the high-pitched squeal Mariah Carey and Ariana Grande do is called the whitle-register, and with proper training, all women can be taught to develop this part of their voice.",
    "38zsc7": "TIL Moon Dust cuts through spacesuit material and is terrible to humans, causing a disease called Moon Hay Fever",
    "3q129b": "TIL that even while holding the record for the single highest paid season for one player in NBA history, Michael Jordan made more money last year alone than in his entire active NBA playing career from his jump man and air Jordan royalties.",
    "28pfqd": "TIL Han Solo was an Imperial Lieutenant before his companionship with Chewbacca.",
    "12f2t1": "TIL Brian May, guitarist for Queen, uses coins, especially the English sixpence, as guitar picks.",
    "11atf6": "TIL: Carrie Fisher and William Shatner have a standing feud about Star Wars vs. Star Trek; George Takei has tried to mitigate.",
    "udmnn": "TIL: That an ancient Greek wrote a science-fiction story over 1,800 years ago, featuring plant-based aliens living on the Moon",
    "9xxjf1": "TIL Harvard scientists managed to store a GIF animation of a galloping horse in the DNA of bacteria",
    "8fuvj7": "TIL That Ariana Grande held a charity concert after the Manchester bombing where over $13,000,000 US dollars were raised to help the victims and families that were affected. Over 14,000 people from the original concert were eligible for free tickets, and the concert sold out in under 20 minutes.",
    "1bysrm": "TIL Police actually have their own Youtube called BLUtube, where they share law enforcement videos.",
    "16p386": "TIL Samuel L. Jackson was mentored in his early career by Morgan Freeman",
    "czeki1": "TIL Connie b. gay is credited with coining the term \"country music\" which was previously known as \"hillbilly music\".",
    "3p6whb": "TIL there is a golf course in Australia that has a group of bull sharks living in one of its water hazards.",
    "38d14t": "TIL that kickball is also called soccer-baseball Canada",
    "8dn43x": "TIL that amnesics who play Tetris and have no memory of playing Tetris still experience the \"Tetris Effect\"",
    "8niu6c": "TIL Director Robert Rodriquez declined to direct Deadpool in order to focus his attention on Spy Kids 4",
    "4otiae": "TIL a German graffiti artist painted a 250 square meter bridge to make it look like it was made out of Lego.",
    "9ln78q": "TIL that plain grey shirt Mark Zuckerburg wears all the time costs between $300 and $400",
    "305fot": "TIL that Bell distributed a manual cardboard computer to high school students in 1968 to teach them how computers work",
    "2k4op7": "TIL it has been 37 years since a comedy won the Academy Award for Best Picture.",
    "3lfooa": "TIL that James Gunn wanted Chris Pratt for Guardians of the Galaxy so much he was willing to CGI a six pack on the actor",
    "yvwdz": "TIL: the co-founder of reddit has a cat named karma.",
    "2b9wpp": "TIL that since jellyfish are 98% water, they evaporate in the sun.",
    "31jnmg": "TIL multiplayer mode in GoldenEye was added last minute, without the knowledge of Rare and Nintendo",
    "42n23x": "TIL Jackie Chan manages a K-Pop boy band",
    "104oc1": "TIL Michael Chiklis Went Bald at Age 20 Because Of A Mishap With Theater Makeup",
    "1d0wyk": "TIL that Facebook's \"like\" button is illegal in the German state of Schleswig-Holstein.",
    "1560nd": "TIL skinny jeans can cause nerve damage",
    "czrqva": "TIL The chicago cubs were the first baseball team to win back-to-back world series; and didn't win again until 2016.",
    "1rjwdf": "TIL there is evidence of Methane based life on Titan, a moon of Saturn.",
    "3peb61": "TIL when the Portuguese introduced chili peppers to Japan in the 16th century, rather than being eaten they were commonly put into socks to keep toes warm.",
    "xqbvh": "TIL that fantasy congress exist, where players draft members of congress and points were based off Legislative success.",
    "3fivo5": "TIL Apple's Siri is an offshoot of a DARPA (US defense research) program named CALO",
    "80n8yg": "TIL when the Mets beat the Red Sox in the 1986 World Series, many Yankee fans attended the parade celebrating the Mets' win, saying that \"anyone who beats Boston is worth coming down for.\"",
    "8gnqc2": "TIL that With (Star Wars: The Last Jedi, Beauty and the Beast, Wonder Woman) 2017 was the first year since 1958 (South Pacific, Auntie Mame, Cat on a Hot Tin Roof) that the top 3 highest grossing domestic films were female led.",
    "3l3qoh": "TIL Bruno Mars was interviewed by Pauly Shore on MTV when he was 4 years old",
    "ho6c1": "TIL Michael Jackson did not invent the Moonwalk",
    "2mtd66": "TIL that the last US President to speak a foreign language fluently was FDR",
    "1e2h1w": "TIL Arya is the fastest rising new baby name given to girls in the US, most likely due to Game of Thrones",
    "2sa45k": "TIL soldiers in WWII made simple radios using a razorblade and pencil as the diode, dubbing them Foxhole Radios.",
    "1nks29": "TIL Hillary Clinton used to be a Republican and Condolleezza Rice used to be a Democrat",
    "8l2g5n": "TIL that three young women from Korea were huge stars in the USA back in the 1960s, and were arguably the first K-Pop band.",
    "2al2tc": "TIL in July 1984 President Ronald Reagan called ice cream \"a nutritious and wholesome food\" and established National Ice Cream Month.",
    "65qxgf": "TIL that the same man composed the music to The Little Mermaid, Beauty and the Beast, Aladdin, Pocahontas, Hunchback of Norte Dame, and Hercules",
    "37q5dh": "TIL: The American basketball team, the Washington Generals, played the Harlem Globetrotters over 13,000 times but only won 6 games.",
    "13ag4n": "TIL Morgan Freeman plays golf one-handed due to damaging the nerves in his left hand in a car crash in 2008",
    "8hiaut": "TIL Chadwick Boseman was accepted into a prestigious summer theater program at Oxford University, but couldn't afford to go. He secured funding through a private benefactor, who turned out to be Denzel Washington. Over 20 yrs later Chadwick thanked him in person at the premiere of \"Black Panther.\"",
    "26s9kv": "TIL that people fantasy draft the National Spelling Bee",
    "1401qk": "TIL that all Cornell University students must pass a basic swimming test before they're allowed to graduate.",
    "m9cp3": "TIL: The state rock song of Oklahoma is \"Do You Realize?\" by the Flaming Lips",
    "3a12s9": "TIL that E.T., Blade Runner, Star Trek II: The Wrath of Kahn, Poltergeist, and The Thing were all released on the same month and competed with each other at the box office.",
    "23ycz6": "TIL that fashion and style aficionados look for collar gaps on your clothes to tell if you get your clothes tailored or not.",
    "6pa9yj": "TIL of NASA Scientist Dr. Rich Terrile, who has discovered several moons on Saturn and believes that our world is just a computer generated virtual reality",
    "24jb3s": "TIL Really nasty tactics against history's best cricket player had diplomatic consequences for England and Australia",
    "3v2z90": "TIL Adele has cited the Spice Girls as a major influence in regard to her love and passion for music, stating that \"they made me what I am today\"",
    "1esie6": "TIL A 17 year old female pitcher was banned from professional baseball after she struck out Babe Ruth and Lou Gehrig in succession.",
    "g4pxp": "TIL that the Romans saw wearing pants as a sign of barbarism.",
    "d0cym3": "TIL An iphone game called \"send me to heaven\" scores players on how high they can fling their iphones into the air. the creator said he had hoped to have people shatter as many iphones as possible. apple banned it for \"encouraging behavior that could result in damage to the user's device\"",
    "92n7j5": "TIL that Elton John's 1970 breakout hit \"Your Song\" was written by Elton and originally recorded by the band Three Dog Night, but they did not release it as a single as they wanted to let John, then an upcoming artist, have a go with it.",
    "1wxeie": "TIL Jay-Z was the ghostwriter for a song on the Space Jam soundtrack performed by Bugs Bunny",
    "5a7l1o": "Today I learned that John Urschel, offensive line guard for the Baltimore Ravens has a BS and Masters in mathematics from Penn State, and just finished his first 4 classes of his PhD program in spectral graph theory, numerical linear algebra and machine learning. With straight As.",
    "12h4vn": "TIL Kurt Russell was actually in Forrest Gump ... as the voice of Elvis Presley",
    "42gqyk": "TIL that the Junípero Serra High School JV football team recorded a historically bad season in which they failed to win a game or even score a touchdown yet they never attempted to start their backup quarterback. That backup quarterback they refused to start is 4 time Super Bowl champion Tom Brady.",
    "1coe09": "TIL that Jonathan Hyde, famous for playing British roles in Jumanji, Titanic, The Mummy, and Richie Rich, is actually Australian.",
    "38ztie": "TIL that Claudico, an artificial intelligence computer program using 16 terabytes of RAM, won a Texas hold 'em poker championship for computers, but it was defeated by a team of humans.",
    "5n9r0r": "TIL Both the Boston Red Sox and Liverpool F.C. are owned by the same investment company, Fenway Sports Group.",
    "2oxpba": "TIL that Michael Jackson would beatbox all the parts of his songs to the musicians for them to perform",
    "3u14fj": "TIL that a woman driving to Dave Matthews concert stopped to help a stranded cyclist who turned out to be Dave Matthews himself.",
    "23myo8": "TIL that the real life Christopher Robin died 18 years ago on Easter (April 20 1996)",
    "89ch6b": "TIL Robin Williams wanted to play Hagrid in the Harry Potter films, but was turned down because J.K. Rowling and director Chris Columbus only wanted British and Irish actors.",
    "zr1fs": "TIL Serena Williams is the first tennis player, male or female, to achieve the Career Golden Slam (at least one Australian Open title, French Open title, Wimbledon title, US Open title, Olympic Gold Medal) in both singles AND doubles.",
    "phsmb": "TIL Stanford's free artificial intelligence class uses Google Plus Hangouts to help them teach more effectively.",
    "1btirk": "TIL that Australia is the only continent where venomous snakes actually outnumber the non-venomous ones",
    "kud3l": "TIL that Abraham Lincoln created the Secret Service the morning he was fatally shot by John Wilkes Booth",
    "1l4wqk": "TIL Rejection Letters from Sub Pop Records to aspiring artists start with \"Dear Loser,\"",
    "1gsjzq": "TIL that Stephan Hawking believes that communicating with aliens is dangerous for the Earth.",
    "1y6wzl": "TIL unicef will donate a day of clean water to a child in need for every minute you do not use your cell phone.",
    "2s70f0": "TIL Kim Jong Un cuts his own hair because he is scared of barbers",
    "8d7df8": "TIL Bruno Mars was named after Professional Wrestler Bruno Sammartino",
    "1pq5bq": "TIL That most deals made on the television show 'Shark Tank' are never enacted",
    "4c8qqy": "TIL of Eugene Goostman, a chatterbot-style software program that fooled 33% of judges into believing it was human in 2014, passing the Turing Test for artificial intelligence.",
    "316ltz": "TIL the Turkish national sport is oil wrestling where men douse themselves in olive oil and then wrestle.",
    "39bu7k": "TIL Spotify has 4 million songs that haven't been played once. That's 20% of all their songs.",
    "c2lar": "TIL John McCain was a contestant on 'Jeopardy' in 1965",
    "1wezbp": "TIL The voter turnout for US presidential elections hasn't breached 62.8% in the last 100 years",
    "1au4o8": "TIL people wear pants because of horses. Mounted armies wearing pants were more effective than those wearing robes",
    "3ul61m": "TIL that 1988 a chimpanzee received 400.000 votes in a mayoral election in Rio de Janeiro, coming in third place.",
    "1oox0y": "TIL that the Boston Red Sox only began wearing red socks after Boston's older National League team, the former Red Stockings, dropped red from their uniforms because their manager wrongly feared red dye posed a health risk",
    "3lgzs1": "TIL there are \"gold bugs\" in the ocean called extremophiles, which breath in dissolved gold and excrete solid gold.",
    "3jazo5": "TIL A new British owl sanctuary was opened in 2009 just to house all the pet owls abandoned by Harry Potter fans",
    "29o39b": "TIL Jupiter saves Earth from many asteroids heading towards it",
    "vv8yj": "TIL that the CGI effects in the Transformers movie was so complicated it took 38 hours to render one frame of movement.",
    "2g2s44": "TIL that A third of all divorce filings of 2011 in the U.S. contained the word 'Facebook'.",
    "236ld2": "TIL There was a batman villain named Condiment King and he was defeated by slipping on his own ketchup.",
    "1fjzae": "TIL that Google prefers dogs to cats. Their code of conduct specifically states that they are a dog company.",
    "3bpuah": "TIL the Miami Heat retired No. 23 for Michael Jordan in honor of all the years he played AGAINST them.",
    "3c69tf": "TIL Elvis Presley's daughter has been married to both Michael Jackson and Nicholas Cage",
    "ik8af": "TIL an Xbox 360 has far more power than the flight computer on the space shuttle",
    "3phgyp": "TIL: That since 1989 a Finnish radio station has broadcast 'Nuntii Latini' - a weekly news programme conducted entirely in Classical Latin",
    "1opzub": "TIL the sun makes up 99.86% of the mass of our solar system.",
    "25k298": "TIL Despite being the highest rated film on IMDB, The Shawshank Redemption only grossed about $3 million more than its budget",
    "29oqfy": "TIL the first episode of Homestar Runner was animated using Mario Paint for SNES.",
    "3rpu4f": "TIL Pixar spent three years studying the physics of curly hair in order to correctly render Merida's hair in \"Brave\"",
    "8vtltv": "TIL that Thomas Jefferson created his own version of the Bible, using a razor to cut out the 'supernatural' parts, such as the miracles and the resurrection. Today, new members of Congress receive a copy upon election.",
    "1f22vu": "TIL in 2005, McDonald's paid hip hop artists when they mentioned Big Macs in their songs",
    "gpbrk": "TIL There's a website for people that will let you crash on their couch while you're traveling.",
    "72olh4": "TIL Two years after retirement, 78% of NFL players have gone bankrupt or are under financial stress. In the NBA, five years after retirement 60% of players are broke.",
    "2f17js": "TIL the first computer algorithm was written by a woman named Ada Lovelace",
    "1ko20c": "TIL a hockey player was traded for 1$ in 1993, he went on to win four Stanely Cups",
    "4wo96n": "TIL that George clooney wanted to be on an episode of south park, so trey Parker and Matt stone had him be the voice of stan's dog sparky. He only got to make dog sounds.",
    "2y34fw": "TIL that the Nintendo Entertainment System could display only 54 colors.",
    "1zpy5e": "TIL In 1936 a deadly tornado devastated Tupelo MS; one notable survivor was one-year-old Elvis Presley.",
    "1hsr3t": "TIL that architecture, literature, music, painting and sculpture were Olympic events from 1912 until 1952.",
    "yixee": "TIL that a man named Arthur Lintgen can correctly identify a piece of classical music by simply analyzing the grooves on a vinyl record.",
    "5n61ls": "TIL Meryl Streep's first film role was a sports movie",
    "txiyk": "TIL Game of Thrones actor Peter Dinklage was given top billing in Series 2, after winning an Emmy and a Golden Globe",
    "1qor44": "TIL that Michael Caine became an actor because all the prettiest girls at his school were in drama class.",
    "tmrje": "TIL In the 1995 film, \"Jumanji,\" the protagonist's father, and the villianous hunter, Van Pelt, were played by the same actor.",
    "34ouq8": "TIL that Weird Al Yankovich did voiceover work in the most recent DC animated film 'Batman vs Robin'",
    "23ihvy": "TIL \"Super Mario\" has a moustache because he was too small to draw a mouth on when he was created by Nintendo.",
    "11pyrq": "TIL As a young boy the Third Doctor Who Jon Pertwee played with Winnie the Pooh author's son Christopher Robin (xpost from r/doctorwho)",
    "ywmn0": "TIL Cornell University researchers built the world's smallest guitar,played by a laser, about the size of a red blood cell.",
    "hmpdn": "TIL that a man in New York bought a property and found a barn on that property full of classic cars",
    "7h9fjk": "TIL the Mary Poppins line in Guardians of the Galaxy 2 was ad libbed.",
    "114p1u": "TIL that Jason Paige the singer of the Pokemon theme is also the rapper on \"Black and White\" by Michael Jackson",
    "4yy589": "TIL the Jumpman logo used by Nike for Air Jordan's came from a photo shoot of MJ doing The ballet move grand jeté and was not consistent with the way he jumped.",
    "2sbdx4": "TIL that a band earned $20,000 from Spotify for a silent album. They used the money to fund a free tour.",
    "1he1h9": "TIL Mars's largest moon, Phobos, is one third hollow. Which once led some to believe it was artificial in origin.",
    "qll0z": "TIL that Johnny Depp only said 196 words in Edward Scissorhands",
    "3rrtkb": "TIL The first Google computer at Stanford was housed in custom-made enclosures constructed from Lego bricks",
    "1e511j": "TIL Comedy Central has cancelled over 100 shows since its creation in 1989",
    "12uqdu": "TIL 5 Presidents have been elected while still losing the popular vote. Greatest margin 10%",
    "9vgtx5": "TIL the song 'Royals' by Lorde was banned by two San Francisco radio stations during the 2014 World Series between the San Francisco Giants and Kansas City Royals",
    "mmdnh": "TIL the boy from Jumanji was the voice of Chip in Beauty and the Beast",
    "1mou3a": "TIL there is a planet where shards of glass precipitate sideways at 4500 mph in 2000 degree Fahrenheit weather.",
    "7kln5v": "TIL that James Cameron decided to quit his job as a truck driver to enter the film industry after watching Star Wars.",
    "1bztf6": "TIL a soccer team deliberately scored an own goal to advance in a cup match.",
    "392ucj": "TIL that as a child Elon Musk was bullied so severely he once had to be hospitalized because of a beating from other students",
    "1hxsyk": "TIL Polo shirts were originally invented for tennis by famous player Rene \"The Crocodile\" Lacoste and only later adopted by polo players",
    "39bt0n": "TIL Target Corporation actually licensed the pseudo-French pronunciation \"Targét\" due its popularity",
    "8pcngf": "TIL the British male voice on Siri is the voiceover guy from The Weakest Link",
    "744z3x": "TIL that a janitor from Chicago wrote over six years a 15,145-page fantasy manuscript with over 300 watercolor illustrations called \"In the Realms of the Unreal\", which was only discovered after his death.",
    "2pug3y": "TIL Michael Bay's average Rotten Tomatoes film rating is 38%",
    "1iz2wu": "TIL There is a golf course in Dubai that requires 4,000,000 gallons of water a day!",
    "5sgt9c": "TIL Tom Brady was picked 199th (in the sixth round) in the 2000 NFL draft",
    "1otj31": "TIL that the former lead designer for Air Jordan started as a filing clerk at LA Gear. Despite having no formal design training, he submitted a shoe design every day to an employee suggestion box. After six months of that he was hired as a shoe designer.",
    "16bmqr": "TIL Batman was originally based on Leonardo Da Vinci's flying machine",
    "2onjf2": "TIL Polish composer André Tchaikowsky donated his skull to the Royal Shakespeare Company in hopes that it would be used as a prop for the skull of Yorick. In 2008, the skull was used in a series of performances of Hamlet at the Courtyard Theatre, Stratford-upon-Avon.",
    "1edgmv": "TIL that Steven Spielberg Still makes millions from Star Wars Off A Bet With George Lucas they made in 1977",
    "63npol": "TIL that Senator Strom Thurmond holds the record for the longest Filibuster by a lone senator. He stayed on the Senate floor speaking for 24 hours and 18 minutes nonstop in opposition of the Civil Rights Act of 1957.",
    "2ugpuk": "TIL: Bill Belichick is the winningest coach in NFL postseason football with 21 wins. 20 with the New England Patriots and 1 with the Cleveland Browns.",
    "1ng7x8": "TIL Robert Downey Jr. only made 500k for Iron Man, but two years later made 10 million for Iron man 2.",
    "28bipd": "TIL John Green only received an $8,000 advance for his first (and Printz Award winning) book, Looking for Alaska",
    "3lfq1e": "TIL Ant Man made his Marvel debut before Spider-Man, Hulk, Thor and Iron-Man.",
    "lopqy": "TIL that CS Lewis and Tolkien held \"you laugh you lose\" competitions when reading terrible poetry",
    "208vvz": "TIL 14 of the world's 25 largest stadiums belong to American college football teams.",
    "1hhxf0": "TIL in 2002 a Creed concert was so bad that four concert goers filed a lawsuit against the band",
    "1zz5as": "TIL: The Percentage of airtime on Fox News dedicated to opinion is 55%. For MSNBC, it's 85%.",
    "1zfze6": "TIL that Bart Simpsons hit song \"Do the Bartman\" was written by massive Simpsons fan, Michael Jackson.",
    "798f7a": "TIL that Adele's album '21' is the biggest selling UK album of the 21st century",
    "68owmu": "TIL that no woman has ever been nominated for the Academy Award for Best Cinematography. It's the only (excluding obvious gender-specific 'Best Actor' and 'Best Supporting Actor\") Oscar category that has never nominated a female contender.",
    "1xkm71": "TIL there are Japanese pop stars that are 100% CGI with synthesized vocals called Vocaloids.",
    "3gh65h": "TIL pigeons are one of 3 birds that produce milk for their young.",
    "t3tc1": "TIL that many fans of Harry Potter place the date of the \"Battle of Hogwarts\" as May 2nd, 1998",
    "paq6h": "TIL there is only one episode of \"The Simpsons\" where Bart neither appears, nor is mentioned",
    "2qoh9e": "TIL: In the sky, there is a massive highway of bugs ranging from spiders to ladybugs that transports billions a day.",
    "1fstdm": "TIL that Jay-Z never writes his songs on paper before recording them. He memorizes his lyrics as he thinks of them.",
    "32r523": "TIL Walmart, Target, Kmart, and Kohl's were all founded in the same year.",
    "q8jar": "TIL \"Blade Runner\" was the last Sci-Fi movie to be made completely \"analog\", that is, there was no computerized graphics. Thanks AMC Story Notes for that nugget.",
    "5ulw5d": "TIL that doctors are using \"Virtual Reality\" to treat phobias, anxiety and other psychological disorders by a process called desensitisation!",
    "4ii17e": "TIL The Deadpool videogame cost more to make than Deadpool the movie - 100 Mn to 60Mn",
    "28xc23": "TIL that the opposing team receives three bases if a player catches a baseball in their hat",
    "1s2uri": "TIL Alexey Pajitnov, the creator of TETRIS(1984) did not receive any royalties from one of the most popular video game titles until 1996 as the rights were owned by his employer the Soviet government.",
    "14j4j8": "TIL that in 2001 a Michigan judge delivered her ruling in the form of a rap when trying a suit filed against rapper Eminem",
    "15om71": "TIL that the top three wealthiest presidents in American history were JFK, Washington, and Jefferson",
    "212dsv": "TIL Agatha Christie's books have sold 4 billion copies, making her the best selling novelist of all time, and her work ranks only behind Shakespeare's and the Bible as the most widely published books in history",
    "2goutn": "TIL Pink Floyd guitarist turned a 'grand houseboat' on the River Thames into a floating recording studio called The Astoria.",
    "1e8rxe": "TIL The Albuquerque Isotopes minor league baseball team was actually named after the baseball team in The Simpsons",
    "2yyahz": "TIL that toy industry gets involved in Disney animations even before the beginning of the film production.",
    "oi4f0": "TIL that there are pictures of the Iceberg that sunk the Titanic",
    "3ap8ko": "TIL Brian May, the guitarist from queen, has a PhD in astrophysics and has co-authored 3 research papers",
    "1yhhrr": "TIL the TV series Game of Thrones gets financed by Ireland because they film scenes there which boosts tourism incomes.",
    "636ej8": "TIL The first appearance of Groot from Guardians of the Galaxy was in 1959 in Tales to Astonish #13.",
    "1h4s79": "TIL that McDonalds payed rappers $5 for every time they referenced Big Macs in songs",
    "8qulgv": "TIL at 19 years old, Chris Pratt was waiting tables at a Bubba Gump Shrimp restaurant in Maui when he was scouted by a director. At the time he was living in his van and had previously studied acting at a community college for only a few weeks.",
    "2alt22": "TIL that facebook has 56 custom gender options, bringing the total number of options to 58 including male and female.",
    "265oq6": "TIL that Randall Flagg appears in at least 9 of Stephen King's Novels and has a variety of names",
    "5m2qx5": "TIL Stephen King has written a children's book using a pseudonym and reviewed it as himself.",
    "6kcw9v": "TIL Glenn Howerton, who plays Dennis on It's Always Sunny in Philadelphia, was considered for the lead in Guardians of the Galaxy and Jurassic World. He lost out to Chris Pratt both times.",
    "3jgy71": "TIL that two identical twins from Japan released a rap album when they turned 100 years old in 1992.",
    "qevq3": "TIL The Beatles song \"Come Together\" was written for Timothy Leary's 1969 California Governor campaign",
    "3ujkya": "TIL that a single fold in the brain makes the difference between perceiving reality and fantasy.",
    "17i5rm": "Til There are over 750 episodes of \"Pokémon.\" That's about 50 a year for 16 years straight.",
    "17rk7m": "TIL hurricanes in Australia were originally named after local politicians a weather man didn’t like",
    "2pdmm3": "TIL Guardians of the Galaxy's Chris Pratt was discovered waiting tables at a Bubba Gump Shrimp restaurant in Hawaii by Tommy Chong's daughter. She offered him a role in her movie, on the spot.",
    "8zh48u": "TIL the word \"literally\" has been used figuratively for hundreds of years. Charles Dickens, Charlotte Brontë, Jane Austen, and Mark Twain all used it for hyperbole.",
    "czbr17": "TIL Octopus wrestling was a legitimate sport on the us west coast from the 1940s to 60s.",
    "4s71f3": "TIL Children's books have 50% more rare words in them than does an average showing of adult prime-time television.",
    "296aed": "TIL someone wrote a full 300+ page thesis on Micheal Bay's Transformers trilogy, going into detail on how Optimus is a murderer and Megatron is a tragic hero.",
    "d09lq8": "TIL Mark twain hated jane austen's \"pride and prejudice\"",
    "2vu4xj": "TIL a man spent $2600 on a carnival game to win an Xbox and instead won a banana with dreadlocks",
    "15v465": "TIL that there is an annual literature contest that challenges writers to come up with the worst possible opening sentence to a novel.",
    "85s2kf": "TIL that in 2015, the median viewer age for Fox News was 68 years old.",
    "yosef": "TIL Blockbuster declined several offers to buy Netflix for $50 million. Netflix is now worth $2 billion.",
    "5g1oss": "TIL: The show Stranger Things was inspired by Elfen Lied, an anime which the Duffer Brother Matt says influenced the character of 11.",
    "14rwdv": "TIL Olivia Wilde's name was originally Olivia Cockburn. She changed it as a tribute to Oscar Wilde",
    "oldj6": "TIL Morgan Freeman has made par on the \"Extreme 19th\" - the highest and longest par three golf hole in the world.",
    "35220e": "TIL that despite the title, almost all the dinosaurs from Jurassic park lived during the Cretaceous period.",
    "2u0x7b": "TIL Reel Big Fish re-recorded all of their hits for a Best Of album after losing the rights to their old record label.",
    "2x9b29": "TIL: Dr Seuss was voted least likely to succeed by his classmates",
    "31zou8": "TIL Macho Man Randy Savage was signed by the St. Louis Cardinals before starting his wrestling career",
    "1lbto6": "TIL Michael Jackson has a patent. On a device used to achieve the extreme lean in some of his dance moves",
    "9qin7w": "TIL the opening to 90’s Spider-Man: The Animated Series was preformed by Joe Perry, the lead guitarist of Aerosmith.",
    "2inqj0": "TIL the man who sang George Clooney's parts in O Brother Where Art Thou also sings lead on Avicii's \"Hey Brother\"",
    "2y6jp0": "TIL that Michael Jordan was about to ditch Nike when an inexperienced designer created his dream shoe",
    "1b64av": "TIL The longest match in the history of cricket took place in 1939. England and South Africa took part in a single match that lasted 14 days.",
    "1q3xt1": "TIL the development of the Disney animated film Wreck-it-Ralph started in the late 1980's, spanning nearly three decades and four working titles.",
    "95ez80": "TIL that according to the Deadpool 2 screenwriters the post-credits scene is in canon and the voice of the mystery villain is Ryan Reynolds",
    "2168gj": "TIL It's illegal to own pet hamsters in Hawaii.",
    "pjkj2": "TIL we don't actually know how old Kim Jong Un is.",
    "1kvi0v": "TIL there is a store in Alabama that only sells clothes, cameras, etc found in unclaimed baggage at airports",
    "wqpj9": "TIL Johnny Depp lived in an Impala and sold pens to get by prior to his acting career",
    "2wjrvw": "TIL The CEO of Spotify was the CEO of uTorrent in 2006",
    "2jx8ty": "TIL There wasn't a single person involved in filming the original Exorcist that thought it would be considered a horror film.",
    "2u2h41": "TIL Robert Lopez, co-writer of Let It Go from Frozen, co-created and co-wrote Avenue Q and The Book Of Mormon, guest wrote a South Park episode, wrote four songs for the Scrubs episode My Musical, and is one of 12 people to have ever won EGOT: an Emmy, a Grammy, an Oscar, and a Tony.",
    "7obq8h": "TIL Gal Gadot was unaware she was auditioning for Wonder Woman. She thought she would be testing for Catwoman",
    "276vm3": "TIL that the actor playing The Mountain in Game of Thrones Season 4, Hafþór Júlíus Björnsson, is only 25 years old.",
    "2gv9z8": "TIL Dinosaurs were neither warm nor cold-blooded, instead \"mesothermic\" or in between",
    "2qttw2": "TIL Meryl Streep has been nominated for an Academy Award 18 times, 6 more than any other actress, but she's only won 3 times which puts her in second place for most awards",
    "3sp980": "TIL that in the 1960's top bowlers made twice as much as top football stars",
    "29xkh4": "TIL There is a deleted scene that explains why the Terminator has an Austrian accent.",
    "1s9nzv": "TIL The first U.S. Senator to ever be arrested for Civil Disobedience was Lowell Weicker Jr., a Republican protesting Apartheid in '85.",
    "3n755w": "TIL Warner Bros and Lebron James have signed a new deal for a \"Space Jam\" sequel.",
    "3ijgwd": "TIL Lego bricks are very consistent, with only 18 bricks out of every 1000000 made being considered defective. The design and manufacture of bricks is also consistent enough to allow bricks manufactured today to interlock with those manufactured in 1958.",
    "2cfmwd": "TIL The Green Lantern film was originally going to be a comedy starring Jack Black",
    "8lumxy": "TIL the reason the Boston Red Sox and the Chicago White Sox are spelled differently is a result of the teams being formed during a broad movement to simplify English spelling during the early 1900's. The movement was spearheaded by Noah Webster almost a century earlier.",
    "1pvvfs": "TIL In 1998, Serena and Venus Williams said they could beat any man ranked 200 or worse in a game of tennis. Karsten Braasch, ranked 203, accepted the challenge and easily beat them, 6-1, 6-2.",
    "28q0on": "TIL Neil Degrasse Tyson appeared in a Superman comic. He helped the man of steel find his home planet.",
    "29828w": "TIL hummingbirds steal spiderwebs to construct and repair their nests.",
    "8aqnn7": "TIL Monty Python and the Holy Grail was funded in part by British rock stars including Pink Floyd, Led Zeppelin, and Genesis",
    "7b6r9q": "TIL Prince William used to play Call Of Duty on the Night Shift at the RAF.",
    "3s4xzk": "TIL Elon Musk is seriously planning Mars colonization using a heavy lift rocket called the Mars Colonial Transporter",
    "1qo0f6": "TIL that Roger Federer did not win any grand slams in the 2011 season, however he did end Djokovic's 43-match winning streak.",
    "rghic": "TIL that in their face to face confrontations, neither Batman nor Joker refer to one another by name.",
    "wi5pp": "TIL Bill Nye was the science consultant for Disney's Flubber",
    "2j7rvp": "TIL Mackinac Island, MI has banned motorized vehicles for over a hundred years. Most travel by horse-drawn carriages or bikes.",
    "lsu4l": "TIL clowns copyright their makeup designs on eggshells",
    "myt9f": "TIL that Leonard Nimoy played a role in the original Mission Impossible Series in the 60's.",
    "2u5tzz": "TIL that when E.B. White narrated the audiobook form of Charlotte's Web, it took him 17 takes to narrate Charlotte's death without crying.",
    "3p6z88": "TIL McDonalds' added drive-thru in 1975 to accommodate soldiers who were not allowed to get out of their cars while wearing their fatigues.",
    "3rexu3": "TIL there is a silver coin with Superman on the heads side that is legal tender in Canada.",
    "4aiiaf": "TIL the science fiction films 'Contact', 'The Fifth Element', 'Gattaca', 'Men in Black', and 'Starship Troopers', were all released in the same year, 1997",
    "2gsj9u": "TIL Kim Jong-Un has a degree in physics",
    "1yfloq": "TIL Morgan Freeman is the voice of Birmingham Airport",
    "ib8zt": "TIL the sun produces enough energy in one second to meet the needs of the entire planet for 500 000 years.",
    "21ebq9": "TIL that on 16th August 2013 Google went down for about five minutes, and took 40% of web traffic with it.",
    "1n4i86": "TIL There is a toy Han Solo in every Firefly episode",
    "1jqrpa": "TIL there is a species of bat called the Chewbacca Bat",
    "9648ae": "TIL IMDB, or Internet Movie DataBase, started out as UseNet, which was a listing of actresses with beautiful eyes",
    "dzk20": "TIL When you zoom into the White House on Google Maps you can see Barack Obama",
    "14skov": "TIL Target owns the second largest building in the world.",
    "2lmz58": "TIL that scientists have genetically altered chickens to express DNA that their dinosaur ancestors once possessed. Eventually, they grew teeth.",
    "iqdws": "TIL that in 1934, North Dakota's governor declared martial law and seceded from the US",
    "1cm4gt": "TIL That on January 4, 2013 Sony stopped producing the Playstation 2",
    "3nhdt5": "TIL George Washington is considered by most historians to have been a bad public speaker.",
    "1oq2jv": "TIL the oldest goldfish lived to be 43 years old.",
    "54vahy": "TIL Tom Ford, the director of Nocturnal Animals, is also Tom Ford, the fashion designer. He started his career working for Perry Ellis, Gucci and Yves Saint Laurent before launching his own label. His first film, A Single Man, starring Colin Firth, was nominated for an Academy Award.",
    "7z2r4o": "[deleted by user]",
    "9i1pnj": "TIL The Canadian prime minister serves at Her Majesty's pleasure, meaning the post does not have a fixed term. In a survey, 51% thought the prime minister was directly elected by Canadians when this is not the case",
    "2ostd8": "TIL Michael Jordan was once asked why he wouldn't endorse black democratic candidate Harvey Gantt in a North Carolina senate race, to which Michael Jordan responded, \"Republicans buy shoes too\".",
    "7o357z": "TIL not only is Wonder Woman the highest-grossing superhero origin movie, it is also the highest-grossing WWI movie",
    "1kuh9g": "TIL that the backgrounds of Batman The Animated Series were drawn on black paper instead of white to show a darker tone.",
    "77f3n7": "TIL that Serena Williams won her 23rd Grand Slam tournament (Australian Open, January 2017) while two months pregnant without dropping a single set.",
    "29iih3": "TIL after German goalkeeper Harald Schumacher collided with French defender Patrick Battiston in the 1982 World Cup semifinal, leaving the Frenchman unconscious and with broken bones, Schumacher beat out Adolph Hitler in a newspaper pole asking who was the least popular person in France.",
    "20an0z": "TIL the current Library of Alexandria has a saved copy of the internet in case the internet burns down.",
    "8ca74v": "TIL In a survey carried out by the BBC in the UK in 2003 which received over 750,000 votes, the top four novels were: The Lord of the Rings by J. R. R. Tolkien; Pride and Prejudice by Jane Austen; His Dark Materials by Philip Pullman; and The Hitchhiker's Guide to the Galaxy by Douglas Adams.",
    "3y7rfs": "TIL: Coach Stan Van Gundy was fined for saying NBA shouldn't be playing games on Christmas Day",
    "bmugg": "TIL Selena Gomez and Demi Lovato appeared together on Barney and Friends as kids",
    "mwjjf": "TIL Up until 2005, a married couple, for 24 years, scheduled all 2430 Major League Baseball games played each year",
    "czcgf8": "TIL French national sporting teams use the rooster as a national symbol because rooster in latin (gallus) is similar to the name used for gaul (gallus), otherwise known as the area of current-day france.",
    "3a5nro": "TIL that, in July 2005, the British radio station Planet Rock invited their listeners to select a singer, guitarist, bassist and drummer to create the \"ideal supergroup\". The members of Led Zeppelin won in each category.",
    "qk2mz": "TIL Bill Clinton made an appearance on At the Movies with Roger Ebert in 1999 and reviewed Fight Club and American Beauty",
    "1bheim": "TIL in a typical Major League Baseball season a total of approximately 160,000 baseballs are used.",
    "7cxfp9": "TIL that, after the release of 'The Hunger Games' and 'Brave' in 2012, women's participation in archery rose by 105%",
    "4gcyfo": "TIL that Shakespeare intentionally made grammatical errors to heighten the attention of his audiences before key points in his plays - the technique is called 'functional shift' and the use of it keeps the brain alive!",
    "x0pdp": "TIL there are over 300 registered Superheroes in the United States.",
    "18o9ki": "TIL the hubble telescope discovered a galaxy so big that it shouldn't exist according to modern physics",
    "1zi7fz": "TIL the famously extinct Dodo bird is actually a sub-family of Pigeon.",
    "3f9zum": "TIL Elon Musk's SpaceX shot a cheese wheel into space as a nod to Monty Python's Cheese Shop Sketch",
    "36uug1": "TIL Ivan Reitman was going to direct a 1983 Batman script, casting Bill Murray as Batman and Eddie Murphy as Robin",
    "25jxw3": "TIL Mark Twain was one of the first to patent \"Adjustable and Detachable Straps for Garments\", also known as Suspenders",
    "7204tk": "TIL that when Parker Brothers tried to introduce a german version of Risk, the board game in which players try to dominate a map of world, the German government threatened to ban it on the grounds that it might encourage imperialist and militaristic impulses in the nation’s youth.",
    "8jmowy": "TIL that the, \"are you human\" tests on many sites serve a second purpose; aiding in the design of tests used for machine learning. (5:35 in the video)",
    "295w32": "TIL it would take over 9.4 million typical party balloons to lift Carl's house, in the Disney Pixar movie \"UP\"",
    "1fpovc": "TIL that ravens are the only birds to reconcile with members of their own species after fights to avoid future conflict",
    "wf9pa": "TIL: There are Cat Cafés in Japan and Taiwan where people can pay hourly to play with cats and have drinks!",
    "19a6h0": "TIL that the universe may be one giant superhologram",
    "4mzeue": "TIL Jose Canseco claims to hold the record for longest softball homerun at 622 feet",
    "2cjphx": "TIL humans finger contain no muscles and are controlled by muscles in the arm and palm pulling on tendons",
    "8lg0w9": "TIL Han Solo Was Supposed To Be Secretly Married to a Wookie in the Original Star Wars",
    "11y7kp": "TIL that Napoleon Bonaparte and Benjamin Franklin lost chess games to an 18th century wooden robot with a chessmaster hiding inside.",
    "jdlzv": "TIL The arrow in Amazon's logo means they have everything from A to Z",
    "mcvlj": "TIL Kim Jong Un's (son of Kim Jong-Il) half-brother was favored to be the heir to North Korea but fell out of favor when he was caught with a fake passport trying to enter Tokyo Disneyland.",
    "1zb6fl": "TIL that steam pianos used to exist, and they could be audible for miles.",
    "22c5gf": "TIL that Hugin and Munin, Odin's ravens, appear in The Avengers film, during Thor and Loki's argument on the mountaintop",
    "1wkrs5": "TIL audible watermarks are embedded on Universal Music Group's songs on services such as iTunes and Spotify.",
    "7tjbaj": "TIL that Sir Anthony Hopkins has composed classical music, to critical acclaim.",
    "3aaaov": "TIL the New Zealand basketball team are nicknamed the \"Tall Blacks\"",
    "u4v1j": "TIL Apollo 11 astronauts had to declare moon rocks through customs upon return to Earth",
    "8qe0y0": "TIL Bobby Richardson of the New York Yankees is the only person to win a World Series MVP despite losing the series.",
    "6hzhbv": "TIL The Guardians of the Galaxy soundtrack album reached number one on the US Billboard 200 chart, becoming the first soundtrack album in history consisting entirely of previously released songs to top the chart.",
    "9ekkfs": "TIL that matt damon cameoed in Deadpool 2 giving the funny speech about toilet paper being inferior to wet wipes",
    "2qrwlr": "TIL Emma Watson almost wasn't Hermione in the Half-Blood Prince. She had considered not returning but decided that she wouldn't be able to watch someone else play Hermione.",
    "1re0zn": "TIL Lionel Messi, who is valued at 120 Million Euro, has more market value than 13 of the clubs he plays against in Spanish La Liga.",
    "7s1mkb": "TIL the Jacksons “Victory Tour” played a major role in Robert Kraft buying Sullivan Stadium, and eventually the New England Patriots.",
    "zw0lf": "TIL Elvis Presley recorded over 600 songs during his lifetime, but he didn't write any of them.",
    "8pume9": "TIL 13 years before the movie \"Incredibles II\" came out, there was a sequel to the first Incredibles that exists in a video game form, and is called \"The Incredibles: Rise of the Underminer\".",
    "1oczr0": "TIL that Breaking Bad Seasons 2-5 have a perfect score on Rotten Tomatoes.",
    "bq2hp": "TIL John McCain makes a cameo in the movie 'Wedding Crashers.'",
    "2frnm4": "TIL Stan Lee created Iron Man because he thought no one would like him.",
    "gsuov": "TIL Bill Clinton only sent two e-mails while President, and one was to see if he could do it right",
    "w0gm9": "TIL if you ask Siri to sing a song she'll sing the same song as HAL 9000 of A Space Odyssey",
    "79pj9u": "TIL that the Stranger Things title font is also used in Paramount's FBI piracy warning, 1980s Stephen King novels, and Choose Your Own Adventure book cover titles.",
    "3bkpdb": "TIL there are no net economic gains for the countries that have played host to the Olympics or the World Cup",
    "2nmpds": "TIL that animals develop white patches on their foreheads when they are domesticated.",
    "24soqx": "TIL there is a region of space that may be pulling galaxies outside the observable universe.",
    "9fn28g": "TIL Chris Pratt stole his Peter Quill/Star-Lord costumes, including the jacket, from the set of “Guardians of the Galaxy” so that he could wear them to visit sick children at the hospital if the film was a hit.",
    "30p1q0": "TIL: Australia have won 45% of all Cricket World Cups, They have appeared in 63% of all Finals and They have won 71% of their finals appearances.",
    "1derov": "TIL That Michael Jordans best friend is the limo driver who gave him a lift when he first arrived in Chicago back in 1984.",
    "47nop0": "TIL that during the 2015 Paris attacks the German National Soccer Team couldn't go back to their hotel and as a result had to sleep on mattresses and as a sign of solidarity the French National Team slept with them in the stadium.",
    "565ewn": "TIL that there are two ballparks in major league baseball over 100 years old: Wrigley Field (Chicago Cubs) and Fenway Park (Boston Red Sox)",
    "1si7c9": "TIL Imagine Dragons started their own charity, the Tyler Robinson Foundation, to support children with cancer in 2013.",
    "cm3j4v": "TIL the first written use of the word “nerd” is by Dr Seuss, in his 1950 book *If I Ran the Zoo*",
    "2kkxtu": "TIL Mark Twain called the cherimoya \"the most delicious fruit known to men.\"",
    "1iepc0": "TIL that the same guy, Elon Musk, founded PayPal, SpaceX AND Tesla Motors",
    "1d9asw": "TIL that the company that operated the Titanic is now a part of Carnival Cruise Lines.",
    "2rj4bp": "TIL Clint Eastwood is a lifelong jazz enthusiast, pianist, and scored several films, including Million Dollar Baby",
    "35peu2": "TIL that Gavin Free, known for Rooster Teeth and Achievement Hunter on YouTube, also worked on the slow motion cinematography for Hot Fuzz, Sherlock Holmes: A Game of Shadows, and Dredd",
    "2x2ig2": "TIL that Martin Luther King convinced Nichelle Nichols to continue on Star Trek in her role as Lt. Uhuru.",
    "8iu7m2": "TIL the actor who played The Hulk in the original 1970's TV series, Lou Ferrigno, has been voicing the character for decades, including every appearance in the MCU up to Avengers: Age of Ultron (2015).",
    "2376ze": "TIL: In 1905 Mark Twain used the word \"Swag\" to parody King Leopold II and the Congo Free State",
    "19p2kv": "TIL that Daft Punk negotiated the TRON Legacy soundtrack over a pancake breakfast where they wore their trademark robot helmets",
    "16tc31": "TIL a Seahorse is the only fish to have a neck",
    "1tllw0": "TIL The alternative names for our planet Earth, besides Gaia, are also Tellus and Telluris",
    "1qilzs": "TIL Superman once wielded Thor's Hammer. Not because he was a Super-man but because he was \"Worthy\".",
    "w4foi": "TIL no physical clone trooper costume was ever produced for the Star Wars prequels. Every single clone trooper is a computer generated image.",
    "idyg9": "TIL Mission Impossible was first a TV show",
    "7b2cfe": "TIL in 2013 when Ed Sheeran's \"The A Team\" received a Grammy nomination Elton John tried to get Ed a performance slot at the award show, but was told he was not high-profile enough. Elton decided to perform with Ed to solve the problem.",
    "9ynvzh": "TIL that the four-cell shapes in Tetris are called tetrominoes, a subclass of shapes called poly-ominoes. Oddly, the word poly-omino is a back-formation of the word \"domino\" assuming that the \"d-\" means two, as in \"two squares\". In reality, the etymology of domino is unrelated to its shape.",
    "hfxjv": "TIL the governor of Oklahoma has an Oklahoma shaped pool.",
    "54dzir": "TIL that Deadpool (2016) is the highest grossing R-rated film of all time, the highest grossing X-Men film, and the highest grossing 20th Century Fox film not directed by James Cameron or George Lucas.",
    "3g99qw": "TIL Jann Mardenborough became a professional race car driver by beating 90,000 people in the video game gran turismo.",
    "2nxlr1": "TIL that Steven Colbert went before congress in character to defend Agricultural Job visas for immigrants.",
    "180l7c": "TIL Dinosaurs had giant fleas with beaks the size of modern syringe needles.",
    "1lmsd8": "TIL that there are Wizard of Oz inspired shoes that actually guide you home when you click your heels together using a GPS system.",
    "19mg8m": "TIL - That the highest score ever in a football game occurred in 1916 when Georgia Tech defeated Cumberland 222-0",
    "5y37xp": "TIL In 2014, Taylor Swift removed her music from Spotify because \"music should not be free\"",
    "1zywus": "TIL that the all time tennis grand slam leader, Roger Federer, has never retired from a match once the match has started. He has been on tour for 13 plus years.",
    "2ezxvw": "TIL: An individual horse has a peak power output of 14.9 horsepower",
    "8g58en": "TIL The Boston Red Sox are owned in part by The New York Times.",
    "6kjziz": "TIL That on Ole Miss' campus the speed limit on some roads was 18 mph to honor former quarterback Archie Manning's jersey number. Later, it was changed to 10 mph to honor his son who also was a great quarterback, Eli Manning.",
    "559dcs": "TIL that the first woman to run a major motion picture studio in the United States started her career by selling toilet paper on which she put the Gucci logo",
    "3aycnq": "TIL that one of the first typewriters was initially called a \"literary piano.\"",
    "rbkmr": "TIL The main character of \"Troll\" was named Harry Potter, back in 1986 !",
    "3lorqp": "TIL that Indian government sets up a polling booth in a forest full of lions for a single voter.",
    "jlujp": "TIL Katy Perry is the only artist to have tied Michael Jackson's record of 5 Billboard #1 singles off of one album.",
    "jdg8n": "TIL in Guatemala close relatives of former presidents cannot legally run for president",
    "3q274s": "TIL The longest work of fiction ever written is three million words long and six times longer than War and Peace, as of July 2013. It is a Super Smash Bros. Brawl fanfic.",
    "1fcod6": "TIL there was an unsanctioned Russian version of the Teenage Mutant Ninja Turtles where they met Batman and a ballerina T-Rex",
    "w4nzq": "TIL there are 33 Call of Duty games",
    "6cq6tg": "TIL Dr. Seuss's editor bet him $50 that he couldn't write a children's book in 50 words or less. Dr. Seuss won the bet with his book Green Eggs and Ham.",
    "1k5rdt": "TIL That the Anderson House bed and breakfast in Minnesota used to offer a free cat companion for the night when booking a room.",
    "24qw62": "TIL Walmart only sells clean versions of albums and if an artist refuses to make a clean version Walmart will not sell it.",
    "3oihph": "TIL ed sheeran wrote and recorded the song I see fire for the hobbit in one day",
    "160vzl": "TIL that the Mona Lisa's model might well have been Da Vinci's assistant, Salai - a young, effeminate male.",
    "1ub9mm": "TIL that in 2010, Lou Reed and his wife held a high frequency concert for dogs.",
    "9p0w28": "TIL when the Bulgarian monarch died at 49 during WW2, his 6-year-old son Simeon became the leader. Shortly after, 97% of Bulgaria voted to end the monarchy in favor of a democracy. In 2005, 64-year-old Simeon ran for Prime Minister of Bulgaria and won, making him the country's leader again.",
    "1vvdj4": "TIL that the Toy Story Trilogy has a Rotten Tomatoes Average Rating of a 100%",
    "16xlxf": "TIL the first movie about the Titanic was released a month after its sinking, and starred one of its survivors",
    "kfc8o": "TIL Those Humungous American Flags at Football Stadiums Weigh 1,100 Pounds and Cost $50,000 to Make",
    "36pgvc": "TIL that American citizens have been voting in the presidential election from space since 1997.",
    "194wl7": "TIL That The Beatles planned to be one of world's first audiobook publishers",
    "tq2l3": "TIL the deepest note in the universe is emitted by a black hole, producing a note 57 octaves below middle C.",
    "7vy0dy": "TIL the rapper Drake owns a pair of solid gold OVO Air Jordan 10s, made by artist Matthew Senna. According to the owner, the shoes weigh about 100 pounds.",
    "1ebboe": "TIL that Leonardo DiCaprio is producing a Twilight Zone movie",
    "wa7pc": "TIL that The Avengers caused a notable increase in shawarma sales.",
    "77v5kd": "TIL Sock hops were named after the fact that you had to take off your shoes to protect the varnished cafeteria and gymnasium floors.",
    "7yg2qk": "TIL the scientist John von Neumann (1903-1957) could by the age of 6, divide two 8 digit numbers in his head and converse in ancient Greek. He published over 150 papers during his lifetime, and is considered by many to be among the most intellegent humans to have ever lived.",
    "27x8ta": "TIL that \"The Fault in Our Stars\" author, John Green, was a contributor to MentalFloss and can be seen in some of their web blogs",
    "pas5s": "TIL that in addition to Peyton and Eli Manning, there is a third, older Manning brother: Cooper",
    "228qc6": "TIL Emma Watson is a certified yoga instructor.",
    "40yjgb": "TIL Adele is credited as playing the drums on \"Hello\"",
    "13t3ah": "TIL the US military uses an Xbox 360 controller to control one of their EOD robots.",
    "3dhr63": "TIL Henry Cavill almost missed the call for the role of Superman cause he was playing \"World of Warcraft\"",
    "212q3i": "TIL George Clooney is the only person ever to be nominated for Academy Awards in six different categories.",
    "227p8e": "TIL: Transhumanists want to upload their minds to computers and memory sticks",
    "vqhhd": "TIL that the planet Uranus actually rotates sideways and \"rolls\" around the sun rather than \"spinning\" like the other planets.",
    "1jp466": "TIL that Albert Einstein charged $1 to sign his autograph. He donated all money received this way to charity.",
    "1vuxkn": "TIL scientists have made a robotic arm that a paralyzed woman can control with her thoughts",
    "35mfvs": "TIL in WWII, soldiers would carry metal-plated Bibles designed to fit securely into their uniform's chest pocket called \"Heart Shield Bibles.\" As their name implies, the Bibles were designed to stop a bullet from reaching the soldier's heart.",
    "1a1ebe": "TIL That migratory birds flying in a V formation reduce their induced drag by 65% and increase their range by 71%!",
    "1lhrng": "TIL before he became a rapper, Eminem's true dream was to become a comic book artist. His favorite superhero was Spider-Man.",
    "2nf66y": "TIL there is a genre of movies called Bromantic comedies and include Harold and Kumar, The Hangover, and Pineapple Express.",
    "3r4hxw": "TIL George Hudson was the first to propose modern-day daylight saving time, because he wanted more time to go collect bugs...",
    "14bgs6": "TIL Teddy Roosevelt was a staunch conservationist and banned Christmas trees from the White House",
    "2tijht": "TIL Dogs have 'Eureka moments' and enjoy the experience of solving a problem in order to obtain a reward.",
    "1fvxyw": "TIL that when South Park aired its family guy episode finale the producers received flowers from The Simpsons crew",
    "15owim": "TIL Tom Brady's wife, Gisele Bundchen, makes more than double her husband's salary.",
    "1sn7a9": "TIL that author John Green worked as a children's hospital chaplain before writing \"The Fault in Our Stars.\"",
    "czeyh5": "TIL According to billboard, 'radioactive' by imagine dragons is the song with the most longevity ever, having spent nearly two years in the hot 100.",
    "68i5y9": "TIL that Kristen Stewart co-authored a paper about artificial intelligence",
    "1v9x2t": "TIL: In Tunisia you can book an overnight stay in Luke Skywalker's boyhood home for only $10",
    "ve6cf": "TIL Mario Kart Wii is the best selling racing game of all time",
    "27ruha": "TIL that Thom Yorke was credited with playing the \"laptop\" on some Radiohead albums.",
    "liu03": "TIL that Edgar Allen Poe wrote the oldest known example of a cyborg in fiction.",
    "ruhdi": "TIL Evan Almighty is the most expensive comedy ever made, with a budget of $200 million.",
    "37guo4": "TIL Alicia Keys first appeared on the Men in Black soundtrack and was credited with writing her own song. She was only 16.",
    "17tpj9": "TIL an unauthorized Harry Potter sequel was sold in China consisting of \"The Hobbit\" with the names changed to Harry Potter characters",
    "1uz5ll": "TIL that the movie Inception shares many similarities with a Donald Duck comic released eight years before it.",
    "qh9wd": "TIL 1930s actress Hedy Lamarr helped to invent the cellphone, Wi-Fi and GPS",
    "71xxij": "TIL that Jim Dale performed 300 voices for the Harry Potter Audiobooks and had to playback recordings of himself on set to remember each one, each time.",
    "1ej62g": "TIl Thomas Edison filmed the only known footage of Mark Twain",
    "inr34": "TIL: King Abullah of Jordan had a non-speaking role on Star Trek Voyager",
    "32ohln": "TIL that in some European markets, Netflix monitors illegal downloads to decide which shows to purchase.",
    "msye2": "TIL JK Rowling actively edits the Harry Potter books to fix errors in continuity and established fact.",
    "wvvkd": "TIL Baseball and Cricket are the only major sports where the defense has the ball",
    "fghfo": "TIL that Justin Bieber's \"Baby\" is the most disliked video on youtube with over 900,000 dislikes",
    "2avmpk": "TIL - The writer of Rocky Horror Picture Show is the voice of the dad on Phineas and Ferb",
    "5xanel": "TIL The domain for the island of Pitcairn (.pn) was used to market the Hunger Games as being the \"official\" country code of the series' nation of Panem",
    "1wu6aw": "TIL almost all of The Hobbit's character names were taken out of an old Icelandic poem \"Dvergatal\"",
    "czrvk2": "TIL Nfl quarterback russell wilson is still under a major league baseball contract despite not playing in a regular season game since 2011. the texas rangers traded him in february 2018 to the ny yankees",
    "1hqtgz": "TIL YouTube celebrity Jenna Marble makes $346,827 annually from her channel",
    "9wtqvj": "TIL Mark Twain loved cats. Some reports say he owned as many as 32, he would write them into his stories, and would even rent them on vacation. He once wrote “When a man loves cats, I am his friend and comrade, without further introduction.”",
    "3dhs2t": "TIL the mugshot pictures on Red's parole papers in the Shawshank Redemption are actually photographs of Morgan Freeman's son, Alfonso Freeman.",
    "1o5xog": "TIL that a Satellite was lost on Mars because Locheed Martin used the Imperial system while NASA used the metric system.",
    "1c6hkg": "TIL that Jack Gleeson, who plays Joffrey in Game of Thrones, cites Joaquin Pheonixs performance in Gladiator as a main influence.",
    "25dlbz": "TIL that there were exactly 999 games made for the original xbox console",
    "9n3x4s": "TIL: That the 'Tetris' effect is a scientifically proven phenomenon that Oxford university (and others) proved can alleviate the effects of PTSD. This led to the NHS in the UK advocating use of the game to help people suffering from trauma",
    "9ryb60": "TIL: Farmers used to walk turkeys from Norfolk to London for the Christmas markets. In the early 18th century, around 250,000 turkeys, many in little custom boots, would take the three-month walk.",
    "g0vte": "TIL Bill Nye the Science Guy is the Executive Director of the Planetary Society, an astronomy organization founded by the great Carl Sagan.",
    "1tvxcz": "TIL Marvel Comics spent 10 years convincing the US Government that X-Men are NOT Human.",
    "1fy7lv": "TIL that a 'drabble' is a work of fiction that is exactly 100 words long",
    "1d01jd": "TIL Lady Gaga once bought $1000 worth of pizza for fans waiting in line for her.",
    "68ifdh": "TIL Optimus Prime has died more than 25 times in the last 30 years across comics, cartoons, movies, and video-games. It has become a running joke among Transformer fans.",
    "2elpl9": "TIL there was a movement in the early 1900s that wanted to replace all politicians and business persons with scientists and engineers.",
    "1gbq9r": "TIL That Judge Judy makes $123,000 per episode, making her the highest paid celebrity only after Lebron James.",
    "4hsybr": "TIL that Adele originally wanted to pursue a career in A&R (~talent scouting) rather than performing. She was inspired to change her career path when she saw P!nk perform live at her school in Brixton, redefining her idea of what an artist can do in a live setting.",
    "hd3ou": "TIL that Rupert Murdoch has apparently supported both Hillary Clinton and Barack Obama in campaign elections.",
    "d0chb4": "TIL The cafeteria scene in spider-man where tobey maguire catches falling food on a tray is actually real with no cgi involved, it took tobey 156 takes to nail the shot.",
    "1k6t2k": "TIL that dogs can learn over a thousand words and can reason better than chimps.",
    "hxus3": "TIL that there are controllers created for quadriplegics so they can play XBOX 360 and other consoles.",
    "3sela7": "TIL that near the end of Super Bowl 46, the New England Patriots let the New York Giants score a touchdown, and the Giants tried to avoid scoring a touchdown, both to increase their odds of winning. The Giants involuntarily scored a touchdown but won anyway.",
    "4le7a1": "TIL Actor Samuel L. Jackson has appeared in at least one film for each of Disney's owned studios. He played Nick Fury in the MCU (Marvel), he was a Jedi in the Star Wars prequels (Lucasfilms), Frozone in The Incredibles (Pixar), as well as the narrator for a Disney Nature Documentary \"African Cats\".",
    "1hmxmx": "TIL that Jimmy Carter had solar panels installed on the White House...and Ronald Reagan had them removed.",
    "1oel8h": "TIL that a Canadian entertainment company will be excavating in the infamous Atari video game landfill for a documentary",
    "12folh": "TIL Minecraft is partnering with UN Habitat to offer kids the chance to design changes they would like to see in their environment.",
    "1t71en": "TIL The NFL is recognized as an \"entertainment\" business rather than a sport, legally, like the WWE",
    "191mj0": "TIL Nintendo is over a hundred years old, having been founded in 1889 as a playing card company.",
    "1xzywv": "TIL there is a full version of Titanic captured using The Sims 2",
    "1rqixc": "TIL Scientists developed a real-life T1000 polymer; the world's first self-fixing plastic called the Terminator",
    "5goz0u": "TIL that \"Ellen G. White is the most translated female non-fiction author in the history of literature, as well as the most translated American non-fiction author of either gender\"",
    "lum9x": "TIL Google’s data center electricity use is about 0.01% of total worldwide electricity use",
    "2mi5y4": "TIL Bruno Mars portrayed young Elvis Presley in the 1992 film \"Honeymoon in Vegas\"",
    "57qhu8": "TIL Many American public libraries carry video games as an attempt to lure teenagers into a library. The result is more teenagers coming to the library and books are being checked out at a rate that exceeds what it was before the gamers arrived",
    "2dqau1": "TIL that Collinsville, IL has a law that prohibits \"saggy pants.\"",
    "3u2cuf": "TIL socks are among the most needed items at homeless shelters, yet among the least-often donated.",
    "2zrl1o": "TIL the novel Picnic At Hanging Rock included a final chapter, that resolved the mystery, which was pulled from the book at the editor's suggestion. It was published posthumously.",
    "3pjwpo": "TIL The highest point on the Moon is 1938 meters higher than Mt. Everest!",
    "31quui": "TIL that Morgan Freeman has been nominated for and won more awards than the total number of movies he's starred in.",
    "150toh": "TIL Wolfram Alpha creator received his PhD on theoretical physics at the age of 20",
    "4wid3o": "TIL in 1984, a company founded by the man who coined the term \"Virtual Reality,\" built a head mounted display and named it the EyePhone",
    "1e3qr3": "TIL the U.S. Department of Defense used 1760 Playstation 3's to build a supercomputer because it was cheaper than the alternative",
    "yok2c": "TIL that the University of Iowa's locker room for visiting football teams is completely painted pink",
    "xy2bc": "TIL that \"The Lord of the Rings: The Return of the King\" is the first and ONLY fantasy film EVER to win an Academy Award for \"Best Picture\".",
    "2qmrc2": "TIL During the Brisbane G20 summit, when Putin shook the Canadian Prime Minister's hand, the latter said \"I guess I'll shake your hand, but I have only one thing to say to you. You need to get out of Ukraine.\"",
    "pd9ti": "Til that the Super Bowl is smaller than soccer's THIRD biggest event",
    "3u8foo": "TIL Swedish programmer Ludvig Strigeus, the main developer of Spotify, was also the programmer that made µTorrent.",
    "2o1l5y": "TIL US Army has a working prototype of a land-based laser cannon that can be guided by an Xbox controller",
    "2zdtc8": "TIL Baseball is so popular in Japan that many fans are surprised to discover its status as America's national pastime.",
    "3pgn9s": "TIL that some species of tarantuals keep frogs as pets to protect their eggs from ants.",
    "1zcovi": "TIL Art, Music and Poetry were once Olympic Sports",
    "9i1upe": "TIL New Orleans Saints cheerleaders are forbidden from eating in the same restaurant as any NFL player and if they are already dining at a restaurant and an NFL player comes in after, the cheerleaders are required to leave.",
    "7rhpcq": "TIL Musician Drake originally found fame as an actor on Canadian teen drama 'Degrassi'. For 100 episodes, Drake played Jimmy: A wealthy teen who becomes paraplegic and eventually pursues a career in music",
    "cza1mn": "TIL Pandora now streams stand up comedy in addition to music.",
    "1ckp8k": "TIL pandora has a cap on how much you can listen for free on a mobile device",
    "9vy2zp": "TIL The World Wide Web was invented in 1989 by an english scientist working in Switzerland for the CERN, an European State funded research organization.",
    "22hd3u": "TIL James Naismith, the inventor of basketball, is the only losing coach in the University of Kansas's history",
    "6ljpqc": "TIL that most Kpop (Korean Pop) stars are molded for years in 'bootcamps' where they are charged for their housing and dance/singing lessons, before being signed under \"slave contracts\" that allow their agencies to control their wardrobe, diets, love lives, and their behavior.",
    "1i5w9y": "TIL that 3.2 billion people, or 46.4 per cent of the global population watched the 2010 FIFA World Cup.",
    "wjvcg": "TIL Ryan Stiles dropped out of high school to pursue a career in comedy.",
    "gyt92": "TIL Obama would be eligible to become president even if he was born in Kenya.",
    "b5fld": "TIL that Tom Hanks can always end his emails with a pun.",
    "19bpob": "TIL that a Canadian teenager once settled out of court and exchanged his domain name MikeRoweSoft.com for an xbox and games from Microsoft",
    "1tdk95": "TIL The \"fly\" on a pair of pants is technically the cloth flap covering the zipper.",
    "19opcf": "TIL Constant novelty from clicking links on the internet can cause real addiction measurable in the brain",
    "7x4iba": "TIL Ronald Reagan was a radio broadcaster for the Chicago Cubs during the 1930s.",
    "196xzh": "TIL that Led Zeppelin song \"Black Dog\" is named after a Black Labrador that was wandering around the recording studio, and does not have any real relation to the song itself.",
    "34mwin": "TIL a man in France impersonated a government official, and managed to sell the Eiffel Tower not once, but twice.",
    "2ar7sc": "TIL Lance Henriksen and Bill Paxton are the only two actors to face off against a Terminator, an Alien and a Predator.",
    "1ox3ov": "TIL that the world's fastest english language rapper, NoClue, can rap at a rate of 14.1 syllables per second.",
    "22e1te": "TIL in 2007 Fox News tried to have a conservative version of \"The Daily Show\" called \"The 1/2 Hour News Hour\", it was cancelled after 13 episodes.",
    "35px5s": "TIL that 30% of American adults use Facebook as their primary source of news",
    "7s5fiv": "TIL that Ben Affleck, a Boston Red Sox fan, caused the production of Gone Girl to shut down for 4 days because he refused to wear a New York Yankees cap on screen.",
    "g11d7": "TIL that Meryl Streep's son has a song that was featured in the film \"Julie and Julia\".",
    "2gd5sd": "TIL there is a species of fish that lives on land all its adult life",
    "9kefns": "TIL cities are successfully using classical music in public spaces to deter crime, with one well-known case study showing it resulted in 33% fewer robberies, 25% fewer assaults on staff, and 37% less vandalism within 18 months.",
    "1cs4rx": "TIL that the composer of the soundtrack to Blade Runner can't read music.",
    "3qtdti": "TIL With 25 billion hours (2.85 million years) of total game playtime, people have played call of duty for longer than the course of human existence.",
    "2yu5zc": "TIL There Are Ballet Slippers That Make Drawings From The Dancer's Movements",
    "9s0x5c": "TIL there are more libraries than McDonald's in the United States, and over half of adults have library cards",
    "80o36l": "TIL Lambeau Field, home of the Green Bay Packers, sets its outward-facing clock fifteen minutes early in honor of their legendary coach, Vince Lombardi. Lombardi believed that if you aren't fifteen minutes early you're late, and used this ideology to discipline his players.",
    "1r5icf": "TIL: George Clooney is distantly related to Abraham Lincoln",
    "1797i6": "TIL that high-heeled shoes were originally worn by Persian cavalry soldiers, perhaps as early as the 9th century.",
    "1cx1ln": "TIL that from 9PM to 12AM, Netflix accounts for 33% of all bandwidth in North America.",
    "1vmbul": "TIL The PacMan ghosts have different \"personalities\"",
    "1lu9w6": "TIL The Chinese Government has censored the word 'Censorship'",
    "3ohxxp": "TIL that there are more possible moves in a game of chess than there are atoms in the known universe.",
    "1gcn9x": "TIL that early versions of Google Moon used pictures of cheese for the closest zoom level.",
    "2bqoqi": "TIL that the sun is only 1 billionth the size of the biggest star discovered in our galaxy",
    "1tqyoh": "TIL that an iPhone has more computing power than the entire US nuclear ICBM deterrent.",
    "1xzea8": "TIL Ping Pong is the name of a company that sells table tennis equipment whereas table tennis is the name of the sport.",
    "145iwr": "TIL Steven Spielberg wanted to make Harry Potter an animated movie.",
    "f4ol7": "TIL Netflix spends 20 times more on postage than bandwidth",
    "t3a17": "TIL 86% of the land in Nevada is owned by the US Government",
    "98rwgw": "TIL Star Wars is heavily influenced by Japanese cinema. For example, \"Jedi\" came from \"Jidaigeki\" or \"period drama\" in Japanese, while \"Chewbacca\" in Japanese basically means \"Mid-level fool\".",
    "xggvo": "TIL The person who wears a different colored shirt than the rest of the team in volleyball is called the Libero and is not allowed to serve.",
    "6xl3s9": "TIL after the town of Naco was split in two by border patrol, the residents of Naco, Arizona and Naco, Mexico started an annual tradition of having a volleyball match over the dividing fence",
    "20m916": "TIL that Fox News threatened to sue the Simpsons in order to stop them from parodying its famously anti-democratic party agenda.",
    "274egj": "TIL that Google Maps calculates traffic by tracking how fast Android devices are moving on the road",
    "3u3sfx": "TIL some owls keep blind snakes in their nests as helpful associates, reducing the abundance of nest parasites",
    "vxxa0": "TIL there are no snakes in New Zealand",
    "1ccjgw": "TIL Abraham Lincoln was the only U.S. president who had a bartender's license",
    "2ulnsv": "TIL that there is a programming language in which the programs are written in musical composition, and functional programs have jazz-like harmonies.",
    "1axqkr": "TIL Calvin and Hobbes window decals and T-shirts as well as most other memorabilia are all copyright violations.",
    "2mhrsm": "TIL a fictional Playstation exec accidentally retweeted an unlock code for the PS3, while the company was actively prosecuting people for doing so.",
    "1xjqff": "TIL in the 1992 World Series, the U.S. Marine Corps color guard carried the Canada flag into the stadium upside down.",
    "1y7gie": "TIL Wikileaks published the government's plans to destroy Wikileaks.",
    "yuzpq": "TIL The White House has twin buildings in Ireland and France.",
    "1l0jlv": "TIL Aerosmith made more money from Guitar Hero than any album",
    "2wydv5": "TIL Three of the four members in the band Imagine Dragons have the first name Dan",
    "czby71": "TIL After france brought the score to 4-1 during a 1982 world cup match between kuwait and france, sheikh fahid al-ahmad al-sabah, who was president of the kuwait football association, came down to the field and demanded the referee cancel the goal. the referee gave in and canceled the goal.",
    "2mb2uj": "TIL the man who designed Macho Man's wrestling gear also designed clothes for Jimi Hendrix, Aerosmith & more.",
    "6cuuiv": "TIL that there are only 2 African Americans in the Country Music Hall of Fame",
    "bsijs": "TIL that coins in Super Mario Kart on the SNES made you go faster with the more you had, and stopped you spinning out",
    "8iogu7": "TIL that the spaceships in Thor: Ragnarok are named after classic Australian Holden cars.",
    "svhiv": "TIL Michael Jordan wore his University of North Carolina shorts under his uniform in every game because he believed they brought him luck.",
    "1ce1xf": "TIL a lab named Waterloo Labs built a real life Mario Kart at an amusement park in Austin, TX!",
    "1e7x9p": "TIL that if Earth’s entire history was viewed as a 24 hour period, humans would only represent 1 minute and 17 seconds.",
    "1zaf4z": "TIL Elton John has sold more than 300 million records and for 31 consecutive years (1970–2000) he has had at least one song in the Billboard Hot 100.",
    "6qczpk": "TIL At Chicago's Wrigley Field, if the Visitors hit a homer into the bleachers, Cubs fans throw the ball back - onto the field!",
    "1wbpm9": "TIL Cooper Manning, older brother of Peyton and Eli, had to quit football before his college career began due to being diagnosed with spinal stenosis",
    "9uot3s": "TIL that until 1805 in the US, the runner up in a presidential election automatically became the vice president",
    "2aehyo": "TIL Facebook has done psychological experiments before, affecting \"real-world voting behaviour of millions of people\" during the 2010 Congressional elections",
    "750lwn": "TIL the US Senate used the same gavel for 165 years until Richard Nixon cracked it",
    "2sfbqv": "TIL that George R R Martin was originally unsure about including dragons in Game of Thrones (ASoIaF) until Phyllis Eisenstein convinced him with \"George, it's a fantasy – you've got to put in the dragons.\"",
    "czrdd1": "TIL Oscar wilde was living in paris and he cabled his publisher in britain to see how his new book was doing. the message read: \"?\" the publisher cabled back: \"!\"",
    "5d88zy": "TIL an iPhone has about 75 elements in it — two-thirds of the periodic table.",
    "yopzi": "TIL that Katy Perry and Snoop Dogg's \"California Gurls\" was actually a West Coast vs East Coast answer song to Alicia Keys and Jay Z's \"Empire State of Mind\"",
    "1a73mk": "TIL Christopher Nolan invited several top directors to a private screening of the first six minutes of The Dark Knight Rises to persuade them to fight against digital cinematography and preserve film.",
    "2et5di": "TIL that Dr. Seuss technically was a doctor. He received an honorary Ph.D. from Dartmouth... and it was only then that he added \"Dr.\" to his pen name.",
    "3jwu7e": "TIL Miley Cyrus' brother, Trace Cyrus, is also famous. He is the lead guitarist and backing vocalist in Metro Station.",
    "vvgok": "TIL the very first US Congress passed, and George Washington signed into law, a health insurance mandate.",
    "1op5ul": "TIL that The Land Before Time was produced by George Lucas and Steven Spielberg.",
    "3393aq": "TIL DARPA has an open catalog of project details ranging from Language Translation(Broad Operational Language Translation [BOLT]) to Machine Learning(Probabilistic Programming for Advancing Machine Learning [PPAML]).",
    "18bz8k": "TIL \"Reddit\" itself is a portmanteau of \"read/edit\" and of \"read it,\" i.e., \"I read it on Reddit\"",
    "2y58qj": "TIL The White House still Uses Floppy Disks in part for storing files.",
    "3nj2ur": "TIL: Someone built a working 16-bit computer using nothing but the basic Minecraft building blocks",
    "2ilip8": "TIL that Ayn Rand, the poster woman for the Tea party and Republicans everywhere, was on Social Security and Medicare.",
    "868q30": "TIL that the Chicago Cubs have employed pitchers with 4, 5, and 6 fingers on their pitching hand.",
    "676eyd": "TIL that Joseph Haydn, a classical music composer, wrote a musical piece in which the musicians gradually leave the stage until 2 violins are left in the end",
    "3o3rj8": "TIL Shakespeare invented the names Miranda, Jessica, and Olivia.",
    "34a1kn": "TIL Waldo from the popular \"Where's Waldo?\" children's books consistently appears in predictable locations on each illustration. Taking advantage of this fact, you can find Waldo in under 10 seconds on almost every illustration.",
    "1o4fxp": "TIL the very first post on Reddit was made by user kn0thing (co-founder Alexis Ohanian) about The Downing Street Memo.",
    "3nuvk6": "TIL In 1973 two Yankees pitchers swapped families permanently",
    "1w2jq4": "TIL George Clooney has helped fund a satellite that documents and records war atrocities in Africa that would otherwise be ignored.",
    "3egoho": "TIL Washington DC's flag is based upon George Washington's ancestral coat of arms.",
    "5952ul": "TIL that Alex Smith took so many AP tests in high school that he entered university as a junior. The quarterback received his bachelor's degree in two years, and began working on a master's degree, before becoming the first overall pick in the 2005 NFL draft.",
    "1ax4jh": "TIL Comedian Drew Carey served 8 years in the Marine Corps where he would tell jokes to his fellow marines jumpstarting his comedy career.",
    "32htv3": "TIL Bruno Mars doesn't use his real name (Peter Gene Hernandez) as his stage name in an effort to “avoid being stereotyped” as a Latin pop singer",
    "z10w2": "TIL That Stephen Fry did the narration for Little Big Planet, Hitchhiker's Guide to the Galaxy, and Harry Potter video games.",
    "3nh70u": "TIL Tesla Motors publicly releases their patents to encourage competition and the advancement of electric vehicle technology.",
    "tox3q": "TIL that in 1972 the band Deep Purple broke the world record for the loudest concert ever. Three audience members were rendered unconscious.",
    "2zebgq": "TIL Istanbul has a vending machine that releases food and water for the city's stray dogs in exchange for recycled plastic bottles.",
    "31kfmi": "TIL that the women's net in volleyball is 7 inches shorter than men's, but in women's basketball the net is the same height as the men's net.",
    "47808v": "TIL The Replicants in Blade Runner were composed entirely of organic matter, without any of the \"mechanical\" parts usually found in movie robots.",
    "8731b2": "TIL that the symbols and written script featured in Black Panther are based on an actual script called Nsibdi, dating back as far as the 4th century and indigenous to present-day Nigeria",
    "1kp1sa": "TIL that the raptors in Jurassic Park were not generated through computers but had humans inside the suits....",
    "26u88u": "TIL Mark Twain was a confederate solider.",
    "czbgge": "TIL Lionel messi only scored 1 goal in the 2006 and 2010 fifa world cups",
    "r0yht": "TIL Lincoln was the first president to be photographed for his inauguration and John Wilkes Booth was in that photo.",
    "87wuc2": "TIL That George Clooney once gave 14 of his close friends $1 million each as a surprise gift.",
    "1wvq9f": "TIL that there is a radio station that translates solar activity into sound and you can listen live to the sun's music",
    "3gto9i": "TIL Almost all animals and plants synthesize their own vitamin C, but humans cannot because the gene for this enzyme is defective",
    "1qdhj5": "TIL that freshwater fish only \"drink\" water through their skin via osmosis, while saltwater fish also drink water through their mouths",
    "3h3e08": "TIL Texas elected their first female governor, the second in the nation, before some states even ratified the 19th amendment.",
    "6ccudz": "TIL As of 2014, the average salary for a professional softball player is between $5,000 and $6,000.",
    "2oschi": "TIL every time Pac-Man eats a regular dot, he stops moving for one frame (1/60th of a second), slowing his progress by roughly ten percent—just enough for a following ghost to overtake him.",
    "1i5qtd": "TIL that Nintendo Japan liked Nintendo of America's translation of Animal Crossing so much, they re-translated and released it in Japanese.",
    "zbei1": "TIL there is a fishing community in Indonesia that has pet sharks",
    "19s3oh": "TIL the song Can You Feel The Love Tonight was almost cut from The Lion King, Elton John had to campaign for it to be left in. It went on to win the Oscar for best original song.",
    "55ggnf": "TIL that Kim Jong-Un's older brother, Kim Jong-Chul, was spotted going to an Eric Clapton concert in London, this was not his first but one of several.",
    "1h78h0": "TIL Han Solo was a Tie Fighter Pilot prior piloting the Millennium Falcon",
    "zug8m": "TIL Christopher Robin Milne, the inspiration for the character of the same name in the Winnie the Pooh books and Disney franchise, was a soldier in WW2 and was described as a \"dedicated atheist\".",
    "18jxjc": "TIL that some dogs in Moscow have learned to use the subway.",
    "19ueyk": "TIL in 1999, Australian programmers reused some code in a military virtual reality simulation, accidentally resulting in kangaroos running away from helicopters and then shooting back at them with stinger missiles",
    "17qcxu": "TIL that the rapper Drake graduated high school on October 2012 at the age of 25",
    "3wwmlc": "TIL Monopoly is based on The Landlord Game, a socialist board game all about the evils of monopolies. With socialist messages.",
    "93d2se": "TIL that in 2006, a man who worked at the Royal Australian Mint managed to steal $100,000 worth of coins over the course of a few months by filling his boots with coins every day. He got caught trying to cash them all in a surrounding town.",
    "2ry2zt": "TIL Walt Disney was fired from his job at a local newspaper in Missouri for ''not being creative enough.''",
    "24k7nx": "TIL Aladdin's pants were modeled after MC Hammer.",
    "30cl6s": "TIL that once an Icelandic horse leaves Iceland, it can never return.",
    "2bqxda": "TIL that Michael Keaton was so against Batman Forever, that even $15 M couldn’t sway him to reprise his role.",
    "1mcbfh": "TIL JRR Tolkien denied The Beatles access to make a \"Lord of the Rings\" film with John as Gollum and George as Gandalf",
    "3b6ud6": "TIL Chris Pratt joked about Steven Spielberg giving him the lead in Jurassic Park 4, in 2010.",
    "3ay7bm": "TIL that German soccer player Mesut Ozil donated his €300,000 World Cup victory bonus to pay for surgeries for 23 children in Brazil.",
    "9y475x": "TIL At different times during the development of \"Deadpool\", James Cameron and David Fincher, both friends with Tim Miller (the film's director), read the film's script and championed the project to Fox executives.",
    "uwef8": "TIL The Founder of Hershey's Milk Chocolate Planned to Sail Home on the Titanic but Work Luckily Intervened",
    "8mnr5v": "TIL in 2016, Roger Federer suffered the biggest injury of his career when he stretched too far while drawing a bath for his daughters and tore a meniscus.",
    "3ibf89": "TIL The actor Peter Dinklage, most notably known for playing the character Tyrion Lannister in the medieval fantasy TV show 'Game of Thrones', is actually related to nobility in Germany. The Westphalian noble family \"von Dincklage\".",
    "3rs08z": "TIL that every US president with a beard has been a Republican.",
    "tq8fs": "TIL Iceland are rewriting their constitution via Facebook; allowing the public to make suggestions and alterations.",
    "ddy50": "TIL that Paris Hilton was in the 2007 Guinness Book of World Records for \"Most Overrated Celebrity\"",
    "3popk9": "TIL John Cena is a fan of Japanese anime and his favorite anime film is Fist of the North Star.",
    "1v1obe": "TIL That in the beginning of Iron Man, Tony Stark's captors are revealing the entire movie plot in a language called Urdu",
    "4pxqis": "TIL French defender Lilian Thuram scored only two international goals in his career, both of which came in one game – the 1998 World Cup semi-final where France won 2–1",
    "2gnt77": "TIL New York's area code is 212 because it was the fastest number to dial on a rotary phone",
    "ohkkr": "TIL Daniel Radcliffe voiced the cartoon parody of Twilight's Edward Cullen on The Simpsons episode Treehouse of Horror XXI.",
    "1uq88x": "TIL Wal-Mart, Coca-Cola, American Airlines and two other corporations released a movie called Proud American in 2008. The movie featured a overly-patriotic storyline about the wonders of American life. It was a failure, and became IMDB's worst movie of the 2000's.",
    "w26mn": "TIL classical music concerts had loud, moving, wild audiences during the performance.",
    "hlvue": "[deleted by user]",
    "1ql2k3": "TIL in 2009 State Hillary Clinton and Russian counterpart Sergey Lavrov symbolically pressed a \"reset\" button. Except the Russian was mistranslated to say \"overload\", they pressed it anyways.",
    "6u9vfo": "TIL that, by using astronomy, we have guessed the date that Odysseus took back the throne of Ithaca as described in Homer's 'The Odyssey': April 16th, 1178 B.C.",
    "34n9ah": "TIL that there are 70 full episodes of the Joy of Painting on the official Bob Ross YouTube channel.",
    "3fjlia": "TIL Orson Scott Card won both the Hugo and Nebula awards (the two biggest science fiction literature awards) two years in a row for his book Ender's Game and its sequel, Speaker for the Dead, in 1986 and 1987.",
    "v67sn": "TIL Freddie Mercury used the same piano to record Bohemian Rhapsody as Paul McCartney used to record Hey Jude",
    "4s8nh1": "TIL that Shakespeare's works take on a different meaning when performed with an era-appropriate accent instead of a modern one, often introducing rhymes or puns that don't work in modern pronunciations.",
    "l49ch": "TIL that Blizzard Entertainment gives awesome swords and shields to its five- and ten-year employees",
    "53kwfp": "TIL when North Korea sank a South Korean Warship in 2010, South Korea responded by blasting the hit K-Pop song \"Hit your heart\" across the border using large military loud speakers.",
    "7n249s": "TIL When Ed Sheeran won a Grammy in 2013 for \"The A Team\" he wasn't deemed famous enough to perform alone so Elton John insisted on a duet with him.",
    "9tqoza": "TIL Tesla (the car company) is not the only electric car company named after Nikola Tesla. There's a competing brand called \"Nikola\" which makes electric vehicles. They're currently suing Tesla for 2 billion dollars for patent infringement.",
    "b9gkq": "TIL: If astronauts out on a space walk wanted to talk in private, they would touch helmets.",
    "xnkh7": "TIL there are wild birds in Australia that can mimic the sound of cameras, car alarms, and chainsaws.",
    "gzauo": "TIL John McCain was born in the Panama Canal Zone. After a bipartisan review and a Senate resolution, it was concluded he was a natural born citizen.",
    "9c4du7": "TIL That on April 1st, 2015, the Smithsonian had a special one day viewing of Wonder Woman's Invisible Jet",
    "kxm5z": "TIL the first President of Zimbabwe was called President Banana",
    "1djl14": "TIL that in 2009 Activision created CODE. The Call Of Duty Endowment, which has raised over 8M dollars in the efforts to help returning Veterans find work.",
    "2gs56z": "TIL Johnny Depp always travels with his Jack Sparrow costume so he can randomly visit children's hospitals dressed in character.",
    "9ad6u2": "TIL J.K Rowling was rejected by 12 publishers before Harry Potter and The Philosopher's Stone was accepted by Bloomsbury - and even then only at the insistence of the chairman's eight-year-old daughter.",
    "8kvh49": "TIL that Bradley Pierce, Kirsten Dunst's character's brother in Jumanji, was also one of the original voices of Miles from Sonic the Hedgehog.",
    "2qi34a": "TIL The longest match in tennis history went on for 11 hours and was spread over 3 days.",
    "2o6mfm": "TIL: Netflix employs a team of \"taggers\" who are paid to watch Netflix and tag the content.",
    "1ax2u6": "TIL Congress or the President can declare someone an honorary citizen of the United States. Only 7 people have ever had this status.",
    "1kzbo5": "TIL that there was an episode of Mr. Rogers where he learned to breakdance",
    "5rxx0t": "TIL that Nike’s pitch to Stephen Curry was so poorly executed that one of the PowerPoint slides still had Kevin Durant’s name on it from a previous presentation. It was after this that Curry went on to sign with Under Armour.",
    "7grzqw": "TIL that in 2013, Star Wars was dubbed in Navajo, making it the first major film to be dubbed in a Native American language",
    "172awq": "TIL that most of the musicians heard playing on Michael Jackson's album \"Thriller\" were actually members of the band Toto.",
    "7smopb": "TIL in 2011, Ed Sheeran went to a street party and played 'You Need Me, I Don't Need You' to a small crowd",
    "czsoli": "TIL Ancient greeks used white lead and cinnabar as makeup. cinnabar is basically mercury.",
    "y3w1g": "TIL Former Partiots RB BenJarvus Green-Ellis has never fumbled the football in his NFL career.",
    "1eq2pc": "TIL Kareem Abdul-Jabbar's dominant use of the dunk got the shot banned from college basketball for over a decade.",
    "2nrajh": "TIL US Open quarterfinalist Gael Monfils beat the \"Roger Federer of paddle tennis\" after learning how to play just days earlier",
    "5lpg8x": "TIL \"Ice Ice Baby\" was the first hip hop single to top the Billboard charts",
    "84r5fh": "TIL Lebron James has a photographic memory and is able to remember exact in-game scenarios in basketball games he has played throughout his career over the years; growing up he was able to memorize moves in fighting games so well that his friends thought he was cheating.",
    "4qhecx": "TIL 75% of Americans are scared of self-driving cars",
    "11elzq": "TIL Superman gained the ability to fly at the request of Fleischer Studios because animating his repeated jumps was too difficult.",
    "3j7mfj": "TIL that Leo Messi, widely considered the best soccer player in the world and arguably the best player in history, often vomits before games because he is so nervous",
    "1i7s2g": "TIL Johnny Depp jumped in to adopt his Sleepy Hollow costar Goldeneye after he heard the one-eyed horse was going to be put down.",
    "2y921i": "TIL during a G20 summit, Russia gave delegates & heads of state thumb drives & phone chargers containing Trojan viruses that were 'capable of illicitly picking up computer and mobile phone data'",
    "2z0kii": "TIL Siri was supposed to be for Android and BlackBerry phones before Siri, Inc. was bought by Apple back in April of 2010",
    "2d8yz2": "TIL Kim Kardashian has a book about her being “A trailblazer of the ‘selfie movement’”. Titled: Selfish",
    "1bb6av": "TIL that during the 70s, Disney recycled a lot of their animation frames, resulting in identical scenes in some movies",
    "2gv2y2": "TIL Country Music was originally inspired and derived from Celtic music.",
    "3p6n67": "TIL the Chicago Cubs were once called the Chicago Orphans",
    "1fiwm0": "TIL That when Wonder Woman first appeared as a member of The Justice Society in 1941, the group made her their secretary.",
    "pqqnd": "TIL that 'The Last Samurai' is plural and refers to the last clan of samurai and not just Tom Cruise's character.",
    "2uryvt": "TIL A dialtone is in the key of F, serving as a pre-internet trick to tune your guitar",
    "17bonh": "TIL the inventor of the lie detector test, William Moulton Marston, also created Wonder Woman, who wields the lasso of truth.",
    "9p2kf2": "TIL it’s illegal to own a rabbit in Queensland without having a magicians license or being a scientist",
    "s4e1t": "TIL There is an non-profit organization for the advancement of artificial intelligence.",
    "662rrp": "TIL the first sporting event shown on ESPN was a slow-pitch softball game between the Kentucky Bourbons and the Milwaukee Schlitz.",
    "1ygwym": "TIL - Hiccups are a holdover from early evolution when early land animals had both gills and lungs."
  }